{"glo":[{"tweet":"'@OluseunOloyede: RETWEET if @GloWorld data service is very poor. FAV if you are currently enjoying @GloCare data service. @Gidi_Traffic"},{"tweet":"Lmao glo is sick. I'm glad I left"},{"tweet":"I ignored them for a few weeks and called to ask how much it is now... they replied 14k something, I send 14,999! That should do right?!"},{"tweet":"Glo #Lafftafest #Ibadan was suppose to start by 4pm it's 4:34 pm no show @GloCare @gloworld"},{"tweet":"Our relationship started in circa June 2015 when I subscribed for a 5k postpaid line and it was brilliant until Sept 2015..."},{"tweet":"Good evening uncle @MikeAdenugaGlo I want to report your people (@GloCare @GloWorld) to you. I am one very disgruntled customer! -Thread!"},{"tweet":"@GloCare @GloWorld I av a 4G Phone but my SIM isn't LTE compatible.is there any glo shop/outlet at Banana island where i could do SIM swap?"},{"tweet":"Here in Gbagada, simple phone call is nightmarish Mails are not dropping Whatsapp? Takes forever for tweets to drop Sigh"},{"tweet":"Internet connection issue around Omole phase 2 and its environs"},{"tweet":"Good morning, we apologize but may we know the exact network issue? SG"},{"tweet":"@GloWorld @GloCare A week ago, your services went off for 2 days around Lekki-Ajah-Badore-Sangotedo areas yet no apologies. @Gidi_Traffic"},{"tweet":"On my way already"},{"tweet":"and he will be issued a ticket. FA"},{"tweet":"The designated unit will contact all qualified subscribers. One can also visit the venue or Gloworld to buy any Glo product(s) worth N2000"},{"tweet":"@GloCare @GloWorld hello.pls,confirm if ikorodu is covered for GLO 4G service and also If my device is compatible; I use Huawei P9+ VIE-L29."},{"tweet":"85 Naira in 2 days gone and you are telling me you are working on it. When are you stopping the deduction? Will it last forever? Solve this!"},{"tweet":"the data service is really bad. Ago palace way to be specific. We need Compensation."},{"tweet":"No negative deductions ke? Then publish the calls or services I have made for the past 2days the is making my credit go. 08180992207"},{"tweet":"Omniuseless - @Glocare @Gloworld Useless in d east, Useless in d north, Useless in d south, Useless in d west Your Royal Uselessness "},{"tweet":"1/2You keep deducting my airtime balance, called severally to no avail. Only to call today and your rep telling me that my info isn't up yet"},{"tweet":"Glo is a nightmare... The money u shld av used to better ur service has been used to sign ambassadors.. Shame on you @GloCare @GloWorld"},{"tweet":"U guys should fix ur Freaking Network already.. No Data Network since Friday at Ifako-Gbagada.. Today is Tuesday!!! @GloCare @GloWorld"},{"tweet":"I saw this last year and I was in defense of @GloWorld. Now I know it's true. What manner of @GloCare. Data rip off. "},{"tweet":"@GloCare @GloWorld To send a tweet on ur ntwrk take 5min & u clam u'r Grand Master of Data. Bt ur ntwrk is Grand zero. Grand master indeed"},{"tweet":"@GloCare @GloWorld What is wrong with u guys, 1st u reduce ur data allocation/plan, now ur data network is worse. Sumtin needs to be done."},{"tweet":"Plz what's the credit transfer code for @GloCare @GloWorld"},{"tweet":"Poor data service. VERY poor. Can't browse | 08054022482 | Marina & Gbagada"},{"tweet":"@GloWorld @GloCare Am very pissed with ur service #NoService"},{"tweet":"The must useless and sluggish network service @GloCare @GloWorld"},{"tweet":"Here is the number which i normally notice balance reduction... Its happened again yesterday help urgently pls thanks +2348159643798"},{"tweet":"I believe I deserve a reply, one day, I will abandon your miserable excuse of a network, one day and it's almost here"},{"tweet":"And you thought I was the only one @yeh_shua"},{"tweet":"09055344691,Ikorodu High Sch,Sagamu rd,android, 3G/2G network fluctuate"},{"tweet":"@GloCare.@GloWorld. This is what i get all the time uding Glo data bundles "},{"tweet":"@GloCare. @MikeAdenugaGlo. @GloWorld. With data turned on, this is what i get. Had to rely on WiFi. "},{"tweet":"They said you should keep them informed as you progress . Baba progress to Airtel or MTN and send them a screenshot. That's all. UO"},{"tweet":"@GloWorld @GloCare Damn!!! This is so true. I'm even scared of renewing my data bundle b/c your unfaithful network keeps cheating on me. "},{"tweet":"Where are the Glo Ambassadors? Someone said if Glo sponsors NYSC, there'll be No Service. Retweet If you're pissed with Glo shitty network"},{"tweet":"When I get money I go buy @GloWorld/@GloCare turn am to laundry "},{"tweet":"In 2017 I'm still seeing BYTES!! and they call themselves 'Grandmasters of Data'. The person that came up with that line should be flogged"},{"tweet":"It's so annoying really. I was downloading a 74mb file yesterday. Guess what the download speed was? 502bytes/second. In 2017! Imagine"},{"tweet":"Uncle Glo sir! The whole Glo is an error message already. What other error message could you possibly be asking for."},{"tweet":"Maybe they all using a different glo in their office mstchww alabosi people"},{"tweet":"Dear Admin I am sure you have Mtn or Airtel sim why are you pretending like you don't know how messed up glo is. Instead of u to apologize"},{"tweet":"GLO network is just so slow... Before you finish downloading a porn video, you would have given your life to Christ @GloWorld @GloCare"},{"tweet":"Uncle, stop asking me JAMB Questions. The quality of your data is s***. Shikena!! Everyone can attest to that!!"},{"tweet":"Your network is a disgrace! More than 4 days now."},{"tweet":"no network all thru ystd(emergency calls only). Came back @ nyt and has been off&terribly slow. BBM has nt even connected. pic.twitter.com/7LDEu8quJ9"},{"tweet":".@GloWorld .@GloCare stop sending money on shows and Celebs,spend it on Ur infrastructures...folks are complaining about Ur services"},{"tweet":"@GloCare @GloWorld I renewed my data plan of 2000 & I'm still getting 3.5GB instead of 7GB.My No: 09054303350"},{"tweet":"@GloCare @GloWorld nw dia z lil improvmnt dn't jus relax o wrk on ur data ntwork... I dn't want to experience this again it's heartbreakin "},{"tweet":"Make una help me beg @GloWorld @GloCare make dem give me endorsement .. bros @basket_mouth @officail2baba"},{"tweet":"Kindly assist ..... I over scratch #500 card @GloCare cc:@GloWorld"},{"tweet":"This is the 2nd time its happening @GloCare @GloWorld I would sub n the network would be poor Please let it roll over to when I sub 2nite"},{"tweet":"Hello @gloworld @glocare here is my 07058822565 "},{"tweet":"Hello @gloworld @glocare you people deducted #2500 for data auto renew, but I'm yet to get the MB. kindly expodite action on this. Thanks"},{"tweet":"I can't believe that I just called @GloCare on 08050020121 & I was talking to them on my CREDIT! Y'all berra send back my money! @GloWorld"},{"tweet":"The message is a notification about Welcome Back promo for selected subscribers. View details below. TT"},{"tweet":"@GloWorld @GloCare do you have anything to do with this? pic.twitter.com/5ZVSswLRog"},{"tweet":"@GloWorld @GloCare what is this nau?? I've requested to stop this message but I keep getting them "},{"tweet":"Hello @gloworld @glocare you people did not resolve anything o. You kept on deducting again. You must repay me o "},{"tweet":"Issue has been escalated to the unit in charge for assistance. SO"},{"tweet":"Good morning. May we know what you are experiencing?O.S"},{"tweet":"We currently do not have a gloworld office at ife for now.OS."},{"tweet":"Good morning. May we know the issue?O.S"},{"tweet":"Sincere apologies, may we know the exact network issue experienced? AA"},{"tweet":"Good morning, how may we help you? AA"},{"tweet":"Sincere apologies, may we have your number for checks? AA"},{"tweet":"I Rep @MTNNG @MTN180 . MTN every where you go Be careful @GloCare @GloWorld "},{"tweet":"WHY? Why are you being dishonest?!! Anyway, you just lost a customer. At least, I can spend my 5k monthly somewhere else"},{"tweet":"3 days later is 860... I'm told I subscribed to a freaking service!!! A service I'm unaware of, a service I'M NOT GETTING"},{"tweet":"I returned to Ibadan recently and started using the sim again. I recharged 2k, 1k for data... The remaining 1k..."},{"tweet":"@GloWorld @GloCare Just try make your network better ehn! "},{"tweet":"Someone said if Glo sponsored NYSC there won't be any service "},{"tweet":"@GloWorld @GloCare is there a way to get 1 agent to solve an issue?I have been asked over&over for my number by AA OU FA ED,list is endless"},{"tweet":"1. @GloWorld @GloCare seriously u should stop deceiving customers!I was told this morning that my DND has bn activated cc @NgComCommission"},{"tweet":"3. @GloWorld @GloCare ...So what happened to DND???!Just face d truth DND doesn't work period.FIND A SOLUTION OOO cc @NgComCommission"},{"tweet":"@gloworld @glocare pls pls pls do something bout network pls."},{"tweet":"5- lastly, @GloWorld @GloCare return my credit (08116756850) & @myaccessbank return my money as well! If you got hacked, come out clean!"},{"tweet":"4- if the country weren't messed up, companies like @GloWorld @GloCare should be out of business for their unprofessionallism and theft!"},{"tweet":"3- 2500 vanishes from my @GloWorld @GloCare line so I call to know if it's for my roaming plan BUT Glo says; We don't know what happened!"},{"tweet":"and do what there?is it not the same time you asked to do the last time?"},{"tweet":"@GloWorld @GloCare. When/ how did I subscribe to this??? This is 2nd time in 2months I have been added to a service I know nothing about. "},{"tweet":"08057553052, 08068681963, Kainji, Borgu LGA, Niger state. Senior camp, Total, Dam site. Fix up!"},{"tweet":"May we have your cellphone number, alternate contact number, location (town/LGA/State) and landmark? FA"},{"tweet":"Glo this one doesn't work, you just waste my phone's energy. @GloWorld @GloCare "},{"tweet":"@GloWorld CONGRATS! You can now enjoy 20mins of free browsing. Valid this month Dial 777 to check the balance Thank you.but It doesn't work"},{"tweet":"This your bts down everytime isn't funny again o. (2 days on, 5 days down). Fix up pls"},{"tweet":"Hey @GloWorld @GloCare , no network coverage here since sunday night. Epp us!"},{"tweet":"Issue has been escalated to the unit in charge for assistance. SO"},{"tweet":"here 07058822565"},{"tweet":"Kindly provide your number for clarification. SO"},{"tweet":"Toyeen B's World: PHOTOS From #GloMegaMusicTourAjah With @yemialadee http://bit.ly/2rerneN Cc: @GloWorld, @GloCare "},{"tweet":"@GloWorld It's unfair how you keep deducting from my airtime for some stuffs I don't subscribe too. I called your @GloCare nothing done yet"},{"tweet":"you are welcome"},{"tweet":"Deactivated line. Kindly visit any Gloworld with the sim for assistance. SO"},{"tweet":"Thank you. It's perfect now. Thank you very much"},{"tweet":"May we request you visit the Gloworld location. CA"},{"tweet":"i gave you her number earlier"},{"tweet":"i don't have the card its with the Glo agent at sokoto state where I reported my case"},{"tweet":"calling to check on the card up on till now nothing have been down,the missing no."},{"tweet":"Do you want to be frustrated when using the Internet? Then subscribe to @GloWorld data plan. @GloCare"},{"tweet":"@GloWorld @GloCare Now that I am back on Glo please don't let me regret it. Thank you in advance."},{"tweet":"Thank you very much for your line check...did it however tell you how people have tried reaching me without success? Come on don't be funny."},{"tweet":"like seriously *127*53# is now 1638 mb for #1000 glo well done ooooooo @GloCare @GloWorld"},{"tweet":"The issue has been resolved. Kindly remove the SIM from your cellphone, insert again and subscribe. FA"},{"tweet":"Dear Customer, To know more data plan options please dial *777#, For subscription status and remaining volume dial *127*0#."},{"tweet":"You have been unsubscribed from the service. FA"},{"tweet":"Thank you for the compliment. Have a nice day. FA"},{"tweet":"I wonder why u guys do this all the time"},{"tweet":"Please unsubscribe me cos I didn't subscribe to any video"},{"tweet":"Cc: @GloWorld @GloCare So true! "},{"tweet":"Someone said if Glo sponsored NYSC there won't be any service "},{"tweet":"Line check shows your line has been in use. UO."},{"tweet":"We apologize for the inconvenience, our engineers are working on the issue. Please bear with us. We are on it. UO."},{"tweet":"Hi, The designated unit hasn't gotten back to me. This is a follow up based on my complaint yesterday. I am yet to get any response."},{"tweet":"We apologize. Please provide your alternate number and the exact location in Ikeja . UO"},{"tweet":"@GloCare it's over 24hours I made the complaint I am yet to get any response from your end. No call, text or a refund. I'm still waiting"},{"tweet":"I have done that several times. My number is 08052197478. I am in Ikeja"},{"tweet":"Chai dia is God oo...@GloWorld @GloCare what have u pple got to say about this..cos no be lie "},{"tweet":"Someone said if Glo sponsored NYSC there won't be any service "},{"tweet":"@GloWorld @GloCare "},{"tweet":"Someone said if Glo sponsored NYSC there won't be any service "},{"tweet":"I haven't had any service for two days please what's happening. @GloCare @GloWorld"},{"tweet":"Kindly tell the code for 3.2GB for 1k"},{"tweet":"I didn't know why you keep subscribing for what I didn't subscribe 4 and deducting money. Please Unsubscribe 4 auto subscribing.08154783862"},{"tweet":"A day or two after exhaustion?"},{"tweet":"it depends on how soon you subscribe to the plan afterwards ~ OO"},{"tweet":"I've not had reception since Sunday. @GloWorld @GloCare wagwan?"},{"tweet":"@GloWorld @GloCare Oya answer. Why has your network become s***? "},{"tweet":"Is it that bad now, what went wrong with GLO?"},{"tweet":"If I subscribe to a certain data plan due to exhaustion of data,do I still get my full data cap?"},{"tweet":" wickeddddd!!!!! @GloWorld @GloCare see ya life outside??? "},{"tweet":"Someone said if Glo sponsored NYSC there won't be any service "},{"tweet":"@GloWorld @GloCare pls find a lasting solution o and REFUND MY CREDIT!I DIDN'T SUBSCRIBE TO ANY OF THESE,PLS DEACTIVATE cc @NgComCommission"},{"tweet":"@GloWorld @GloCare I DIDN'T SUBSCRIBE TO ANY OF THESE CODES 35184 62013.PLZ STOP SENDING ME USELESS SMSs.REFUND MY CRDT cc @NgComCommission"},{"tweet":"Please confirm the apn, username and password settings on the device. SO"},{"tweet":"I have done that thrice..its still charging me N1/MB and telling me i Am on Flexirecharge..by the way it's a BB10"},{"tweet":"Now I have to write a mail someone will eventually read on Christmas day, I don't know how to handle this issue would have been a better one"},{"tweet":"Number on social media for this crap! Why I tweeted was for quick response, I could have called customer car and waited half a day, now I"},{"tweet":"I'm still laughing, it's easier to buy an airtel, Etisalat or MTN sim than to send a mail to whoever! Get serious! I didn't reveal my"},{"tweet":"If you want to terminate the plan, kindly send a mail to 3gsupport@gloworld.com.State your reason/s for the request and add your number. SO"},{"tweet":"The night plan time is 12am-5am( Monday-Friday) and 24 hours Saturday-Sunday. You can't access it now. SO"},{"tweet":"existing plans does not hinder new subscriptions, may we know the plan you would like to subscribe to? OO"},{"tweet":"simply subscribe to a data plan and go to your settings and delete any other than gloflat ~ OO"},{"tweet":"@GloCare @GloWorld With all the plenty customer complaints about the quality of your network, y'all either got no shame or don't give a s***"},{"tweet":"One last thing..I'd like this numbers to stop calling me; 30052 and 77022...also deactivate the illegal callertune i was charged for.thanks."},{"tweet":"Come & collect your end of the term report card. @Glocare @Gloworld "},{"tweet":"The worst network provider?"},{"tweet":"Only to get a mail today that I gifted another number which is not possible, please refund ASAP"},{"tweet":"I subscribed to the 3g4g plan 08152626030 think Tuesday or Wednesday last week"},{"tweet":"Thank you for the feedback. Have a nice day. FA"},{"tweet":"Hello @GloCare @GloWorld, data network has improved tremendously on Addo road powerline region after your promise to resolve issue. Kudos "},{"tweet":"Claim will be escalated for assistance as will be received from 7018, we apologize. SG"},{"tweet":"Kindly revert to the outlet or any other Gloworld with the device for assistance. SO"},{"tweet":"Text 53 to 127. Please revert with your number if issue persists. SO"},{"tweet":"The issue has been resolved. Kindly remove the SIM from your cellphone and try the method(s) again. We apologize for the inconveniences. FA"},{"tweet":"Dear Customer, To know more data plan options please dial *777#, For subscription status and remaining volume dial *127*0#."},{"tweet":"Dial *777# for info on data plans/service. SO"},{"tweet":"You are welcome. FA"},{"tweet":"Thanks, 12.283gb just confirmed "},{"tweet":"Is it fixed now?"},{"tweet":"I even called a @GloCare @GloWorld customer care rep before purchasing the plan an he assured me I'll be getting 12gb, who did i offend oo"},{"tweet":"I hope this will be the end of the deductions as this is about the 6th time I'm making d complaint and I should get a refund on d deduction"},{"tweet":"@NgComCommission bought @GloWorld @GloCare data, Charged yet data not given and its been stories for over a week, Is this 419 or corruption?"},{"tweet":"I can't subscribe help"},{"tweet":"@GloWorld @GloCare I'm having difficulty subscribing to a data plan on my line 07051838709. Kindly assist."},{"tweet":"@GloCare @GloWorld we have contacted the 121 thousands of time over the past 8months and all to no avail."},{"tweet":"Hope there will be a notification to let us know that it's available. Cos i serious have a business hanging/depending on Internet services"},{"tweet":"It doesn't work ooo. Find a better solution"},{"tweet":"Have called the customer service 2ice today and was told to wait for 48 hours... Will i be off the net for 2 days ni"},{"tweet":"@GloCare @GloWorld. My line is 0905 324 3169. Urgently need to do Data booster or Weekly bundle but your shortcode isn't helping"},{"tweet":"@glocare @gloworld we have endured the poor data network 4 some time, but now we are getting tired of enduring.The faster you act the better"},{"tweet":"sms STOP to 2442 to stop unsolicited VAS sms/calls ~ OO"},{"tweet":"@GloCare @Gloworld your network in Eziobodo #futo is very poor. This area is a student area and has hundreds of glo subscribers residing dia"},{"tweet":"@GloWorld @GloCare I DIDN'T SUBSCRIBE TO ANY OF THESE CODES 35184 62013.PLZ STOP SENDING ME USELESS SMSs.REFUND MY CRDT cc @NgComCommission"},{"tweet":"@GloWorld @GloCare I don't know which is mor annoying,that I DIDN'T SUBSCRIBE to ur unsolicited sms or... #Lagos beware cc @NgComCommission"},{"tweet":"...Or that u send same Message over and http://over.Now more unsolicited sms coming in. @GloWorld @GloCare cc @NgComCommission"},{"tweet":"@gloworld @glocare come to eziobodo #futo and upgrade your data network. Your network here is very poor and disappointing."},{"tweet":"you will get a response, kindly be patient ~ OO"},{"tweet":"there's a challenge on the platform being worked on by the network team, kindly bear with us ~ OO"},{"tweet":"I've done both. Yet, no help was forthcoming"},{"tweet":"@GloWorld @GloCare What is wrong with your pathetic network? If I check my data balance or try to subscribe for data, I get this msg "},{"tweet":"I did that. Yet, the 1k plan autorenewed"},{"tweet":"Thanks"},{"tweet":"How far na? I haven't even binge-watched any show and the 10 gig don dey expire. Wetin happen my guy? @GloWorld @GloCare"},{"tweet":"Tried 3 methods, same response. *127*55*phone number # the normal *777# process and the gift plan name n phone number text to 127"},{"tweet":"It's really really slow, I get to receive messages 1hr after they've been sent and am certain it won't go at all in the evening and at noon."},{"tweet":"@GloCare @GloWorld trying to gift a data plan and i'm getting this response. Kindly check pic. 'Dear customer, to know more data plan...' "},{"tweet":"full data as in how many gig? When I dialled data *127*9# or send info to 127,I see 5g against 10g.has it been topped up?"},{"tweet":"But no, because you are @GloCare you feel you can do and undo with your network data services...It's okay, I can do and undo wt my money too"},{"tweet":"Kindly be informed,You were given the full data.EE"},{"tweet":"Yes you will get the full data volume. AA"},{"tweet":"May we have your number? AA"},{"tweet":"Sincere apologies, provide your number, exact location in Ikorodu, landmark, LGA, exact network issue, device type, network mode selected.AA"},{"tweet":"@GloWorld @GloCare by now u should know u apologies don't cut it!!! Do d right thing and STOP all ur fake apologies!!! cc @NgComCommission"},{"tweet":"@GloWorld @GloCare keep apologizing yet continue to do same thing,what's d essence of apologies??!!! #Lagos beware! cc @NgComCommission"},{"tweet":"@GloWorld @GloCare receiving adverts by SMS shouldn't it be by choice?Even if it's not,must I pay for it?? #Lagos beware cc @NgComCommission"},{"tweet":"@GloWorld @GloCare you have started again oo, I did not request for anything from your 35184 code oo"},{"tweet":"So if you subscribe three days after the expiration you'll still get the full 3.2gb right?"},{"tweet":"Please I need answers to my questions bcoz is really frustrating."},{"tweet":"... To have borrowed me? You forced credit on me I Neva used & deduct my money at any recharge. This is not funny at all. @GloWorld"},{"tweet":"@GloWorld do something plz"},{"tweet":"It is very bad bro pls @GloWorld @GloCare do something about your network coverage in Ikorodu "},{"tweet":"I will use my hard earn money to subscribe @GloWorld yet I can't browse, what's this now?? @GloWorld @TrafficChiefNG @Gidi_Traffic"},{"tweet":"You know God will punish you sha. @GloWorld @GloCare"},{"tweet":"For security reasons call 121 help desk or visit the Gloworld shop for assistance with the over scratched recharge card. TT"},{"tweet":"Visit Gloworld shop with your SIM pack. a valid ID, N100 and list of numbers frequently dialed on the line for replacement assistance. TT"},{"tweet":"@GloWorld @GloCare At least u guys shud make d 1k sub b 2gb and not d 1.6 that's so cruel of u. From 3.2 straight to 1.6 nawa."},{"tweet":"In Idunomwin village off Lagos express way Benin city"},{"tweet":"@GloWorld @GloCare just cos ur subscribers don't av time complaining doesn't mean they r not pissed at ur network. U guys are FCUKED!!! "},{"tweet":"Truth saying!....on top of all the madt increase in tariff,it's a great fuckery! https://twitter.com/ernalbeat/status/868500081208676352 …"},{"tweet":"@GloWorld @GloCare Glo network has been terrible here at Ogba Lagos for days now, what's d problem? Can't do anything meaningful online."},{"tweet":"I was supposed to get 3.2G instead of the 1.6G I was given. Someone cannot even sub in peace again"},{"tweet":"I meant for a monthly subscription. Why are you pple like this seff"},{"tweet":"6.4Gb given for 2plans thus accurate volume given. Thank you. SG"},{"tweet":"Please dial 123 and follow the prompt to recharge. Revert with mobile number, error and recharge serial number if issue persist. TT"},{"tweet":"Good evening, please call 123 and follow voice assistance alternatively, we apologize. SG"},{"tweet":"The number is 09059627033.kindly check it out"},{"tweet":"@GloWorld @GloCare what's happening I can't load card because of network failures"},{"tweet":"Good evening, please confirm your data balance via sms/code otherwise provide number for clarification. SG"},{"tweet":"@Gloworld @glocare why again na? I had my sub done just now and was given 1.6G while I still have an unfinished 900MB"},{"tweet":"LMAO are u for real?? Let's not get in that...sha come and fix ur dead mast! I might be needing ur cheap data very soon"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"The exact issue I'm having with you guys, is, your network is annoyingly slow. Airtel Edge Network is faster than your 4G LTE."},{"tweet":"09 053 2254 15, new ife road, ibadan (about 7km from Nigerian breweries), 08099215283, blackberry....there's a glo mast 500m 4rm my location"},{"tweet":"@GloCare worse network... Cheats @GloWorld"},{"tweet":"May we know the exact issue being experienced at your location to offer you assistance? TT"},{"tweet":"Why is ur service like that of a snail? What is the essence of subscribing to ur data on ur acclaimed 3/4 G LTE & still can't browse?"},{"tweet":"Grand Masters of data indeed."},{"tweet":"@GloCare @GloWorld you see people concern have started sending their numbers. You need to act fast @Omojuwa @Ayourb @MrAyeDee @ELEGBETE1"},{"tweet":"+2347054026286 or +2348141505532,ovia north east local government area iPad 2 iOS devices,Glo card prapaid,name (mr Philip Solomon)"},{"tweet":"Eish, the @GloWorld auto renew isn't half bad fam. I made a mistake. Thanks for the prompt assistance @GloCare. I'm loyal "},{"tweet":"I got 1.6gb bonus. So sorry for the error. My bad. Thanks so much"},{"tweet":"Pls follow so I can DM my phone no. Thanks"},{"tweet":"Please confirm your data balance via code/sms otherwise provide number for assistance. SG"},{"tweet":"I had 256mb left n renewed with 1k. Didn't get 3GB, just 1.5. So renewing early has no benefits?"},{"tweet":"Good afternoon, means need to re-subscribe to another plan within 3days after the expiration of the previous plan. SG"},{"tweet":"I can't with this nonsense auto renew crap @GloCare @GloWorld introduced. Seems it's time to throw away my glo sim. Might have to get Ntel"},{"tweet":"How can I send my info when there's no platform to message you. You aint following"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"TT, I have done that a million times already. Your data network is just sh*t!"},{"tweet":"Good afternoon, no slash, new rule applies to plan not auto renewed/re-subscribed within 3days after expiration of the expired plan. SG"},{"tweet":"@GloWorld @GloCare you played yourself the moment 10gb became 5gb for same price... moving on, bye forever!"},{"tweet":"I'd rather dm you"},{"tweet":"I haven't had network to browse for 3 days, I'm tired of you guys manh.. I've called and called. You guys still can't solve it"},{"tweet":"@GloWorld @GloCare this is for you "},{"tweet":"The worst network provider?"},{"tweet":"Kindly select 3G only network; not Auto, on your device setting for better connection. TT"},{"tweet":"I have glo office stone throw from my house in Abuja and I always have poor network and @GloWorld browse when it likes not when I want2."},{"tweet":"@GloWorld @GloCare ffs I'm tired of receiving all these crap unsolicited texts and adds on my device. I need it to stop, all d 5888 n etc"},{"tweet":"I was home (Abuja) last yr till early this year. Glo network was really poor. There was a time 3GB expired on my phone as I couldn't use it"},{"tweet":"@GloWorld @GloCare you have started again oo, I did not request for anything from your 35184 code oo"},{"tweet":"Using 4.2G in 21 days is insulting."},{"tweet":"@GloCare & @GloWorld, I've condoned ur poor connectivity cos of data price. Nw I am opting out. Paying more 4 poor internet is unnecessary. pic.twitter.com/iFWK6BGjXz"},{"tweet":"necessary assistance. Note, Flexi recharge allows you to browse with your airtime at N1 per 1MB when you are out of data. FA"},{"tweet":"Kindly insert your SIM into another cellphone and text cancel to 127 to stop auto renewal or send a mail to 3gsupport@gloworld.com for"},{"tweet":"May we know the network issue you are experiencing for necessary assistance? FA"},{"tweet":"@GloWorld @GloCare All these celebs u are signing would leave ur network for a better one even use d money u paid dem to recharge d new line"},{"tweet":"@GloWorld @GloCare u guys had better start working on ur masts to give ur consumers better services rather than signing celebs"},{"tweet":"same here in akute o,dey hv turned us to night workers bkoz of dia useless netwk"},{"tweet":"Don't apologize to me. Improve your network quality. This is 2017 ffs! Grow up"},{"tweet":"Thanks much! The full data has been accredited. Glo for life!"},{"tweet":"It is your outlets that claims no network to retrieve sim for over a month now"},{"tweet":"We apologize, kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. AP"},{"tweet":"Your network has gone to a whole new level of bad, only at night times things get a lil better"},{"tweet":"My tweet was quite self explanatory. You send a message to someone today, it's seen the next day."},{"tweet":"@GloCare @GloWorld telecommunications company not record label "},{"tweet":"Morning,We apologize.May we know what the exact issue is? AP"},{"tweet":"Kindly visit any of our nearest Gloworld outlets for assistance http://www.gloworld.com/ng/support/gloworld-shops/ … AP"},{"tweet":"I don't know if I picked Glo because I want to see Basketmouth or Bovi, wtf"},{"tweet":"@GloCare @GloWorld How can a business progress on such and how do you guess intend to service customers with such persistent excuse? ?????"},{"tweet":"@GloCare @GloWorld he has been to your office at Sabo 3 times & fadeyi branch twice but was told there is no network or there is no simpack!"},{"tweet":"@GloCare @GloWorld are you people running out of business? My younger brother has been trying to retrieve his line for almost two months"},{"tweet":"@GloCare @GloWorld every glo subscribers in Anthony village and environs have not been enjoying browsing for almost a week now. @Omojuwa"},{"tweet":"Please retweet if you are disappointed with @GloWorld @GloCare . @Omojuwa @Ayourb @jag_bros @MrAyeDee @ELEGBETE1"},{"tweet":"error message. We empathize. SG"},{"tweet":"@olorunniyitimm6 @GloCare Good evening, please state the number, exact location, landmark, LGA, device type, network mode selected. SG"},{"tweet":"@GloWorld ,@GloCare I want to say bye to your network because am porting to @EtisalatNG because you are a disappointment. @Omojuwa @Ayourb"},{"tweet":"Don't ask me. Cos ts not just me. Every of ur subscriber can't use the internet cos ur netwrk is so shitty and frustrating."},{"tweet":"Good evening, may we know the exact network issue to be assisted/advised? SG"},{"tweet":"Worst network in Nigeria... @GloWorld cc @GloCare"},{"tweet":"We apologize. Kindly visit any of the Gloworld shops at the link for assistsnce: http://www.gloworld.com/gh/support/customer-care-2/ … TT"},{"tweet":"Good afternoon,as at now,8115390710 is not registered. if done above 48hrs, please visit the nearest gloworld/glo zone to re-register. SG"},{"tweet":"Sent them several messages can t dial 121as no signals sent emails too no reply looks no one is concerned with issues"},{"tweet":"See @gloworld @GloCare you people are very useless aswear I am tired of you"},{"tweet":"Happy Children's Day @Glocare @Gloworld since all you know how to do is play with network signal #ChildrensDay"},{"tweet":"@GloWorld @GloCare Grandmasters of Data.... what I do when I hear that "},{"tweet":"Glo will not let me do anything on the internet "},{"tweet":"Eka bo! I've spoken to customer care"},{"tweet":"Not browse.. You guys robbed me of my data"},{"tweet":"@GloWorld @glocare @mikeadenuga PS check Glo Ghana why cellular network is down n since 25th may in Tema Ghana & no action or response"},{"tweet":"you ain't seen nothing yet"},{"tweet":"@MTNNG no offense but your internet service is the most atrocious I've ever come across."},{"tweet":"Was it like that before? This isn't my first time of doing Glo subscription. Just be straight with people"},{"tweet":"if your 3GB for N1000 is for autorenewal option only, why not be straight with people."},{"tweet":"You scam pple, u did advertisemnt every secs, why mst u be shouting everywhr that u giv 3GB for N1000 whn it isn't true."},{"tweet":"I subscribe monthly for 3.2gb which goes for 1,000 naira but this month, I was given just 1.6gb without an explanation!"},{"tweet":"@GloWorld @GloCare Una dey fall my hand gan.I load data 1.6g I no use am because of una poor service, yet una exhaust my data wey I no use"},{"tweet":"of the plan. May we know the network issue you are experiencing within your location for necessary assistance? FA"},{"tweet":"You will start enjoying the full data cap once you subscribe before the expiration of your active plan or within 3 days after the expiration"},{"tweet":"Kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. UO."},{"tweet":"Cc @GloCare @GloWorld Misplaced priorities. "},{"tweet":"Glo spending so much to make rich celebrities richer but can not channel that cash into improving their dead network."},{"tweet":"@GloWorld @GloCare stop frustrating my sister @adunkejoy please. No network in abj, no network in Jos. Where do you people have network pls"},{"tweet":"Text from 7018 says my network signal issues Ref Glo 1-4135603121 request has been resolved. NOT TRUE! Still can't browse the internet!"},{"tweet":"Would appreciate that...an e.g. is that your tweet was sent at 9:05. It's 9:41 & I just got it. Sometimes it a lot longer or even never."},{"tweet":"it's amazing how I spend hours trying to speak to a customer care representative but never get the opportunity."},{"tweet":"That @GloWorld, @GloCare is useless is putting in mildly. They are a waste "},{"tweet":"I've lost all hope with glo network. You guys are stretching the limits of being useless"},{"tweet":"I thought you take your subscribers serious? I reported the case 3days ago. If u can't give me my bundle, refund my airtime shikena!"},{"tweet":"Did u even give me the bundle I subscribed for? Talkless of telling me no bonus on the line???"},{"tweet":"May we know the exact issue experienced. SO"},{"tweet":"What is this one saying? A postpaid line on Gbam Extra?? Radarada!"},{"tweet":"Service has been canceled. SO"},{"tweet":"That's my number +234 905 366 9497."},{"tweet":"I did this when I called your customer rep but it continued. Will DM my number now. It's annoying pls stop this and give me back my airtime"},{"tweet":"May we know the issue experienced. SO"},{"tweet":"Text STOP to 62013 to deactivate the service or revert with your number for assistance. SO"},{"tweet":"Volume Used 12.00 GB(100%). Data consumption is based on the activities done on the phone. SO"},{"tweet":"See ehn, I'm even tired of complaining. Thank God there are other options available."},{"tweet":"@GloCare @GloWorld And this happened again this evening! I NEVER subscribed to any video. STOP stealing my credit in this RECESSION "},{"tweet":"Kindly provide your number for clarification. SO"},{"tweet":"May we know the issue experienced at your end, so we can assist. SO"},{"tweet":"@GloCare @GloWorld does Mike Adenuga uses glo to browse?..... I swear I don't think so.. U guys network needs a review..."},{"tweet":"Kindly re-tweet the issue reported in this thread with your details for reference and assistance. Thank you. SO"},{"tweet":"@GloWorld @GloCare u guys find it hard to keep to ya word."},{"tweet":"you guys piss me off every damn tym. Pick ur customer care line now lemme abuse yal well. Na only una waka come everytym?"},{"tweet":"@GloCare For two days now, two days no network... Because of small rain, useless network!! See me asking for hotspot upandan"},{"tweet":"I've been trying to buy IDD BUNDLE on 07051814426 & d reply I keep getting is to dial *777# that its activated yet its not"},{"tweet":"I thought I was alone. @GloCare @GloWorld has been messy."},{"tweet":"08074125607, location is Xtadoc Estate, off Power line, Addo/Badore Road, Ajah, Lagos. Issue duration at least 2mnths, Gionee M5 mini"},{"tweet":"I need to change my sim card to @GloWorld because of the love I have for @2Baba010 ... Much love bro.. I don port to @GloWorld @GloCare"},{"tweet":"I have a transfer from 202 for N300. Far on excess of amount in contention. If from you: Thank you."},{"tweet":"please deactivate the prophetic subscription. I never activated it. You guys did. Please stop taking our money without our consent"},{"tweet":"Check shows the deduction is made for line subscription to PROPHETIC SHOWER SERVICE. TT"},{"tweet":"Issue escalated for assistance as received from 7018, we apologize. SG"},{"tweet":"The code you gave me is not working or do I still have to pay to deactivate a service I never requested?"},{"tweet":"The sms cancels the service. Thank you. SG"},{"tweet":"Pls what does it cost you to deactivate the service for me?"},{"tweet":"For 22/05/2017, sms STOP to 20644 to terminate service. SG"},{"tweet":"1. I dont answer service code calls 2. The deductions started on 22/5 3. On the 25th I only got a service code call @ 14:36"},{"tweet":"It's so bad that I get a WhatsApp message to the effect that I may have new messages. And the messages eventually come up to an hour later"},{"tweet":"Perhaps you should come down here & feel what we are experiencing. I am online 24/7 & experience is terrible! Can't even read news online!"},{"tweet":"Kindly provide your mobile number for checks and assistance. TT"},{"tweet":"You have a data plan that is not active and you have been connecting using PAYU. Send FLAT to 1234 for setting to activate the plan. TT"},{"tweet":"@GloCare @Gloworld I have over 3G data and yet you people are still deducting my money. I never turned on anything."},{"tweet":"Top of the morning to you. Thank you for your prompt reply."},{"tweet":"Seriously? And in your mind that would work Abi? Well I just did, still nothing. FIX YOUR NETWORK"},{"tweet":"@GloCare @GloWorld can u ppl tell why ur network went being good to SOS since January?"},{"tweet":"@GloWorld @GloCare Sorry did i hear you say grandmasters of data?..you must mean grandmothers cus your network is so sluggish af."},{"tweet":"Am I the only one having problems on instagram with my Glo line @GloCare @GloWorld"},{"tweet":"Photos: A fan surprises @phynofino with his lovely artwork at the #GloMegaMusicTourPH http://bit.ly/2ql8jZa Cc: @GloWorld, @GloCare "},{"tweet":"I provided it in the morning, was told it had been resolved. Pls check your DM, you'd find it there. It's getting really annoying."},{"tweet":"Thank you for the swift response. +2348077111034"},{"tweet":"Thank you for the swift response.+2348077111034"},{"tweet":"The data service around power line, addo Road region in ajah is epileptic @GloCare @GloWorld.. I had to tweet this using my Airtel line"},{"tweet":"Okay"},{"tweet":"Kindly re-tweet the issue reported in this thread with your details for reference and assistance. Thank you. SO"},{"tweet":"Kindly provide your number for clarification. SO"},{"tweet":"I've sorted it out.. Thank you "},{"tweet":"@GloCare @GloWorld Day 7 and I still can't use the Internet, this is beyond ridiculous tbh"},{"tweet":"U people are still stealing my airtime. u claimed to av deactivated ur VAS dt I never asked for. Yet my airtime keeps reducing. E sora yin o"},{"tweet":"5. Attached is the screen shot. Kindly help to stop it. Thank you as I await your swift response @GloCare @GloWorld "},{"tweet":"4. ....unfortunately I got anoda txt dat I sent d wrong message. +2348077111034 @GloCare @GloWorld"},{"tweet":"@GloCare @GloWorld Good evening, I am on autorenewal and I need to buy another plan....how do I get around that?"},{"tweet":"You have not been charged. Please dial *206*22# to cancel the service. SO"},{"tweet":"08065657640"},{"tweet":"Kindly be explicit on the exact network issue experienced. SO"},{"tweet":"I don tire'@tomijori: @Winziey @GloWorld @GloCare My brother, like Ma favor den dey do us'"},{"tweet":"Why una dey carry network and bring am back anytime una like as if no pay money'@GloWorld: @Winziey @GloCare May we know the exact issue"},{"tweet":"@glocare @GloWorld owk u people have started again abi"},{"tweet":"@gloworld @glocare what happen? Internet service has been very poor."},{"tweet":"#Glo. Still waiting pls. As stated right from inception over a week ago, I did not subscribe for it. I expect #fair service. Thank you"},{"tweet":"Information for 9054962739 and not 7069347503 as the screen shot says. Thank you. SG"},{"tweet":"The sms here as sent was 'CONGRATS ! Your N2500 plan has been activated! It will expire on 19/06/2017 19:55.'. Thank you. SG"},{"tweet":"Plan bought on 20/05/2017 19:47:59hrs. SG"},{"tweet":"Kindly visit the Gloworld shop for assistance to resolve this issue. We apologize. TT"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"Still being worked on? But you sent an SMS to me yesterday that it's already been resolved? Okay o, continue lying there "},{"tweet":"Don't mind them"},{"tweet":"@GloWorld @GloCare 08118875298 and 08118875297 were purchased yesterday at the ICM. I cannot make calls or use the 5gb data..."},{"tweet":"So cutting off an unsolicited call now activates subscription!!!!. Please dont insult my intelligence. Post the evidence in public. Thanks"},{"tweet":"I dont do comics, I dont play with my phone and it was in my custody. So How will I activate what I dont need. If I need such I will google."},{"tweet":"we are back to square 1. I NEVER ACTIVATED ANY COMIC services. Can you please give me a proof of same pls?. How can I in this age and time?."},{"tweet":"This is so untrue. For starters, my fone is programmed to automatically block all such calls. I didn't rcv any call & dnt activate any code."},{"tweet":"Have used 2000 and I wish to attend the Lagos event, however, my message keeps bouncing back"},{"tweet":"Hi @GloCare @GloWorld. Please how do I get my ticket to laffta fest."},{"tweet":"Value added what? I never requested for any of these services as none is of any relevance to me. Kindly refund my airtime Pls. Thank you."},{"tweet":"Issokay, I've subscribed again. Meanwhile I still have to send this tweet with via another provider."},{"tweet":"And if I subscribe now then same thing continues, I will get my data/money back, shey?"},{"tweet":"what does DND mean....that's the response I got after sending 'STOP'"},{"tweet":"Yes, I decided not to subscribe because it has been a waste of time, energy & money for the last 3mnths. Run thru d acct"},{"tweet":"For security reasons call 121 help desk or visit the Gloworld shop for assistance with the over scratched recharge card. TT"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"You network keeps fluctuating, one would think your data cap was reduced because better service . Always have to reset my network."},{"tweet":"Good morning, we apologize but may we know the exact network issue to be assisted/advised? SG"},{"tweet":"You guys have been soo terrible for a 2 weeks now @GloWorld @GloCare"},{"tweet":"Kindly visit the Gloworld shop at Oshogbo for assistance with your request. Stay Unlimited! TT"},{"tweet":"Just so I can satisfy you. 08054022482» Marina/Gbagada (Lagos)."},{"tweet":"Good morning. You can help me by improving the quality of your network which is currently absolutely mediocre. AO"},{"tweet":"Please provide the requested information then to proceed. SG"},{"tweet":"Meaning we will continue to enjoy this embarrassing data service?"},{"tweet":"How many times will provide with these info? 08157504100, Ago Palace Way, Grandmate Bus Stop, Okota-Isolo, 3G."},{"tweet":"Noting is wrong with my Locations, Nos &Devices. It's your poor data service you should fix! Stop this pretence & denial"},{"tweet":"I gave you these details yesterday and nothing has been done till now and you're still asking same thing again. 08157504100 Sunny Xperia Z"},{"tweet":"PLEASE HOW MUCH IS YOUR MODEM @GloCare @GloWorld? THE SMALL WHITE ONE."},{"tweet":"Dear @GloWorld, @GloCare you guys keep deducting my airtime even when I don't make calls or do you people now charge us for receiving calls?"},{"tweet":"@GloWorld @GloCare kindly suspend my subscription on 09053171599 as there's no glo service at Nysc fisau camp in Jigawa"},{"tweet":"Please leave me alone. Your data network is hell. Since I subscribed I haven't enjoyed it. It's annoying."},{"tweet":"they can frustrate for africa"},{"tweet":"@GloWorld @GloCare please can u deactivate the video box service which my line was registered for, 0811 999 8006"},{"tweet":"You are welcome. SG"},{"tweet":"Successfully Unsubscribed The User. SG"},{"tweet":"I know that. The STOP command isn't working and the customer care line I've been calling hasn't been able to cancel it either"},{"tweet":"@romikwyn @GloCare Charged for Glo game store, 6611. SG"},{"tweet":"Kindly provide your mobile number for checks and assistance. TT"},{"tweet":"It's too late OLD FAM, I've been complaining for 17months now, say hello to my new Fam @AirtelNigeria"},{"tweet":"From East to the west. North to South...the same story. Glo is rubbish. I don't how I subbed for your data 2 years after I stopped using it"},{"tweet":"Stop this provide exact location nonsense. Your data service is sh*t. The money you use for adverts & frivolities should be used to fix it"},{"tweet":"I can't download & I can't do anything useful with your network. Shame"},{"tweet":"Today is the day I Port my line from @GloCare @GloWorld . What network can one port to Sef ?"},{"tweet":"You will get the full data plan either it is the same plan, a higher plan or lower plan, once the conditions are met. TT"},{"tweet":"Thank you. I hope something can be worked out. Plan towards it."},{"tweet":"I will just find a way to get the IPhone8 on contract when it is released in Nigeria. @GloWorld @GloCare any deals for ur customers?"},{"tweet":"Please what happens if you top up your current 2000 naira data plan with a 1000 naira data plan.... Will There be a 100% data increase?"},{"tweet":"08159353072 , university of Uyo permanent site, Sony C6602 and modem, Uyo LGA,no indoor network both 2G and 3G NB: Others experience it too"},{"tweet":"Behind NYSC camp kubwa, by EKO school, by St. James Anglican church. Mostly when power is out. The 3G disappears. Network goes bad"},{"tweet":"@GloCare pls kindly activate my newsim, i renewed my damaged sim card at a gloworld,I was told my newsim will be activated within 24hrs."},{"tweet":"For security reasons call 121 help desk or visit the Gloworld shop for assistance with the over scratched recharge card. TT"},{"tweet":"Ok. Just checked and saw it...#ItsNoScam..Thank you."},{"tweet":"Please keep your apologies to yourselves "},{"tweet":"The issue has been channeled to the unit responsible for addressing such.Kindly bear with us.For this inconvenience,we apologize.GM"},{"tweet":"08052237467, Mile 2 (Amuwo-Odofin), Tecno W3, network has been horrible throughout this month"},{"tweet":"Kindly supply your number, exact location with landmarks, duration and device type for further support. GM"},{"tweet":"And they just 'reviewed' downwards their data offering Oh. You guys have played yourself. Your data overload was what kept you in the game"},{"tweet":"Kindly call 121[toll free] or visit our nearest Gloworld Shop for further assistance on this.Thank you. GM."},{"tweet":"For the inconvenience,we apologize.However, may we know what your exact experience is data-wise? GM."},{"tweet":"Glo's 3G is the equivalent of GPRS in developed countries @GloCare @GloWorld"},{"tweet":"I'll reply a tweet and it will not deliver. @GloWorld @GloCare You guys need to step up. This is unacceptable."},{"tweet":"@GloWorld @GloCare @glonigeria @Glo you need to go silent a bit with promos, events and sponsorships..work more on improving your services"},{"tweet":"I have and will try to. Issue still not solved. this day marks the 8th Day of such frustrating experience"},{"tweet":"I dont think this is true...I just renewed without my data expiring, still got the usual for N1000..#na wash jor#SCAM"},{"tweet":"Someone will have @GloCare @GloWorld monthly data & still be buying daily Data on other networks to make posts & receive mails. Nawa"},{"tweet":"Please visit the Gloworld having information about your line. you will be assisted. UO"},{"tweet":"To port Send port to 3232, the visit the nearest Gloworld to initiate the porting process. Thank you. UO."},{"tweet":"And ever since I got my line,I never subscribe for any service"},{"tweet":"Location is Malaysia bush, irete, owerri west LGA, landmark: dovely hotel,I didn't temper wit does tins eva since I bought my fone.Techno L9"},{"tweet":"Do something to d GLO network in Ikorodu pls.It is too bad and annoying"},{"tweet":"@GloCare @GloWorld please how can I auto renew my data I'm a bid to get the full benefits?"},{"tweet":"@GloWorld @GloCare thanks for illegal and indiscriminate deduction.It won't happen again once am out of your coverage"},{"tweet":"Y'all calling to invite me to mega fest, meanwhile y'all can't get your story straight!! @GloCare @GloWorld "},{"tweet":"Text 4G to 400 to confirm. SO"},{"tweet":"@GloWorld @GloCare I'd like to confirm is Gionee S Plus phone supports Glo 4G network"},{"tweet":"#easy option is to give up but when will our #business #ethics change & we stop seeing #customers as easy #preys that can be readily skimmed"},{"tweet":"..to go through much hassle to reclaim what was #wrongfully taken; it #xrays everything bad about our #business culture. it is #wrong. ..."},{"tweet":"Kindly provide your number for clarification. SO"},{"tweet":"We are following back. SO"},{"tweet":"@glocare @gloworld pls, i would like to know why my credit is always without me using it. Pls follow me back so i can give u my number"},{"tweet":"We sincerely apologize for the inconveniences. Kindly exercise patience. PE"},{"tweet":"Pls channel funds used in signing 'ambassadors' into actually improving your services/network . Why so useless?! Gosh!! @GloWorld @GloCare"},{"tweet":"@GloWorld @GloCare May Jesus help you guys. Only Jesus can help you guys. Your case is nearing hopeless."},{"tweet":"@GloCare @GloWorld am currently using a friend's hotspot. All I need access to receive and make calls, made some registrations wit this line "},{"tweet":"@GloCare @GloWorld this more than 48hrs and please my/our problem is yet to be resolved.was temporarily ok for few hours on Saturday "},{"tweet":"What's your assessment of Ishaq's 'reform' and performance"},{"tweet":"Dear @GloWorld, four calls today from people asking me about their #jamb2017 result. I am now a JAMB agent? @GloCare"},{"tweet":"Kindly provide your phone number for checks Thank you for your patience. UO."},{"tweet":"@GloWorld @GloCare return all my airtime.ds is stealing. @cnn @BBCAfrica @SaharaReporters @AIT_Online @channelstv"},{"tweet":"change my tariff plan to the one I can use GLO IDD"},{"tweet":"We apologize for any inconvenience you may have experienced. Thank you. UO."},{"tweet":"After deliberation, i believe @GloWorld deserve it. Retweet until @GloCare see this vital attachment. @lindaikeji @todayng @YeleSowore"},{"tweet":"Untill then, let me keep on enjoying some other networks that have the interest of Jos and we their Jos subscribers at heart."},{"tweet":"Bundle or tariff plan? FA"},{"tweet":"@GloWorld @GloCare help me change the bundle on my number 07051814426 to the one that allows IDD bundle activation."},{"tweet":"Issue is still being worked on. Kindly exercise patience. SO'"},{"tweet":"#Glo; rate yourself on #customerservice . This matter been on since 05/18/17 (12:06AM) #unresolved. #well done. I am not giving up. Thanks."},{"tweet":"Photos: @official2baba unveiled as an elite club member of #GloAmbassadors http://bit.ly/2qMjxc9 Cc: @GloWorld, @GloCare "},{"tweet":"Evidently you have not gone through the #trail. On 05/18/17, 6:33AM I provided my number please. Again its 08056071913. Now over 100 hours!!"},{"tweet":"@GloWorld @GloCare I just broke and threw away my Glo sim because Jos isn't included in the cities for The Glo Mega Music Nationwide Tour."},{"tweet":"Nevermind. It's better this morning."},{"tweet":"May we have your number for clarification. SO"},{"tweet":"N100 wrongly deducted. N50 refunded to the account. No explanations made. #Glo this is still very #wrong. Pls make #FULL refund. Thank you"},{"tweet":"GLO: Enjoy the fastest 3G & 4G data speed nationwide...@GloWorld @GloCare ME: "},{"tweet":"The reception here has been horrible since the downpour yesterday (Ajah) @GloWorld @GloCare Is it a general problem? Can y'all fix it pls?"},{"tweet":"Photos: The body on @yemialadee http://bit.ly/2q9vEMG Cc: @GloWorld, @GloCare "},{"tweet":"You are welcome. FA"},{"tweet":"We are now following you. FA"},{"tweet":"So if I subscribed now it will be 1.6 and if I renew before before expiring date it will be 3.6??"},{"tweet":"@GloCare @GloWorld no service for the past 3 days now, is this how I want to rule my world? More like ruin the world. What's all this???"},{"tweet":"There is no network around Niger Delta University, Wilberforce island, Bayelsa state for 3 days now"},{"tweet":"You're halfing my data while sapping fast what I am left with and that's supposed to be the same allocation? Sounds really wrong"},{"tweet":"You'll still get full data if you meet required conditions. SO"},{"tweet":"What's the essence of halfing it if I'm not halfing my payment? This sounds really wrong!"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. SO"},{"tweet":"If you auto renewed/re-subscribed within 3days after expiration, you will get the full data volume otherwise you will get half."},{"tweet":"5k was 24gig & 8k was 48gig. How, in the new scheme, is 5k now just 12gig. And the data drains at the speed of light?"},{"tweet":"The network is too bad!! Most people I know within Suleja,Abuja, Kano and most cities ditching d network for Airtel."},{"tweet":"@GloWorld @GloCare @GlobacomNigeria How come you guys halfed your data services without halfing the corresponding prices? No notice?"},{"tweet":"we have notified the appropriate unit and it will be worked on ~ OO"},{"tweet":"kindly provide your number so we verify the claim and assist ~ OO"},{"tweet":"You just spoke my mind!! I personally use glo because it is an indigenous network, but what do I get for that? Wack network."},{"tweet":"This is the kind of trash that disgusts me. I've been charged, why? Cos my mobile operator can do whatevs. @GloWorld @GloCare "},{"tweet":"just make your network better providing these details won't make any difference Thank you"},{"tweet":"Please be informed that you line is active. Kindly recharge and restart your device then go ahead to enjoy the service. AA"},{"tweet":"@GloWorld @GloCare I hope Glo will take this very serious. You are loosing customers by the day. Am only hanging in for a while "},{"tweet":"Glo should work on their network first before doing things like #GloLafftaFest2017 because after laughing ppl will go home & use Etisalat"},{"tweet":"You guys should upgrade your service na... Glo b like 9ja nepa at Amassoma, bayelsa... @GloWorld @GloCare"},{"tweet":"@GloWorld @GloCare Ya netwrk hs d worst service in 9ja. Afta subscribin 4 10gb ya netwrk disappeard 4 almst 48 hrs nw at Amassoma, bayelsa"},{"tweet":"no response since yesterday......"},{"tweet":"@GloWorld @GloCare plz beat down your data charges. "},{"tweet":"@GloWorld @GloCare how about a night plan since you guys have slashed your data volume."},{"tweet":"That means the two must have active CUG subscription at the same time.. Thank you... @holuboocaler"},{"tweet":"You can but the given web address also allows use of the feature. SG"},{"tweet":"so I can't access the app on my phone? Well done"},{"tweet":"Yes but will be charged. SG"},{"tweet":"Please follow: https://www.instagram.com/accounts/login/ alternatively. SG"},{"tweet":"If two people are on CUG package.if one is not active,can d other wit active subscription make call to the inactive one?"},{"tweet":"111,okeletu, issue duration: over a month now and I don't have alternate number"},{"tweet":"Kindly be more explicit with your request for assistance. TT"},{"tweet":"Please provide exact location in Ijede, issue duration and your alternate number for assistance. TT"},{"tweet":"@GloWorld @GloCare @GloWorld @GloCare For CUG subscribers.is it not possible for one party to subscribe and make call to unsubscribed party "},{"tweet":"@GloWorld @GloCare For CUG subscribers, is it a must for the two parties to 've active subscription... @holuboocaler"},{"tweet":"@GloWorld @GloCare For CUG subscribers, is it a must for the two parties to 've active subscription... @holuboocaler"},{"tweet":"07056395832, ijede ikorodu, Samsung J1"},{"tweet":"Can @GloCare @GloWorld compel her staffs to affirm or dispel this? "},{"tweet":"I'm certain glo staffs are using Airtel "},{"tweet":"I already sent a DM & I suppose this issue will be resolved. Thanks."},{"tweet":"Kindly dial *127*0#, send INFO to 127 or visit http://his.glo.com or download Glo Cafe App to check HSI data balance. TT"},{"tweet":"Exact location keee, Lool, they shoulda asked for ATM number and pin na."},{"tweet":"Glo una don start ooo. U said renew 3days before current data expire which I did but got 5gb for 2,500 instead of 10gb!!!"},{"tweet":"Location; olowora via Berger, Lagos 08154823720. No network in the area everybody is complaining but device working well outside d location"},{"tweet":"if u nid d serial no of d new sim given to me, i can provide it. My old sim is okay but i want it in micro sim nd i was told to do sim swap"},{"tweet":"I don port oo. From fast depleting data of @airtel_care @AirtelNigeria to @GloCare @GloWorld. Am loving this experience."},{"tweet":"@Gloworld @glocare I have 5gig left on 2k5 plan to expire today if sub 1k plan what happen to my 5gig added to the 1k data?"},{"tweet":"Visit the gloworld with a valid id card,at least N100 and the sim pack,with 5 frequently dialed numbers to replace your sim. AP"},{"tweet":"#FBF #FlashBackFriday avec @E_Adebayor! My beautiful & memorable event days in #GLO #GLOBACOM #GLOMobile #CAF #GLOCAF @GloWorld @GloCare "},{"tweet":"Please provide exact location, landmark, LGA, device type, number, alternate contact,network mode selected, error message, we apologize. AP"},{"tweet":"@GloCare @GloWorld my data has not been working since Tuesday and u haven't done anything to it yet... Nah wa oooo"},{"tweet":"For security reasons call 121 help desk or visit the Gloworld shop for assistance with the over scratched recharge card. TT"},{"tweet":"You are welcome. SG"},{"tweet":"Good evening, thanks for the feedback. SG"},{"tweet":"Thanks it's now working fine God bless '@GloWorld: @olapraise001 @GloCare Kindly change network mode (3G or 2G) to improve dowNload. IA'"},{"tweet":"@Gloworld @Glocare I downloaded 96.96mb movie for 48 hours. Grand master of DAT?????. Find solution to your poor service na or contact mfm"},{"tweet":"I can't possibly provide all this on Twitter. It's not secure"},{"tweet":".. my fault. Incidence occurred 2300 hours on 17/05/2017 & 40 hours later I am still being asked to exercise patience!. #wrong, #simplywrong"},{"tweet":"This is not good enough. What if that is all the airtime I had and need to make a call?. I am being put through a stress over what is not .."},{"tweet":"... okay to just walk away?. Yes you can but return what is not yours i.e the subject N100. Wrong has no other name than simply '#Wrong'"},{"tweet":"I see, will wait until the next deduction comes. It sure will..."},{"tweet":"please you people should just tell us you're not willing to do anything, just loaded my Instagram but nothing hs effected"},{"tweet":"Hi, I haven't had service bars in about two days. My internet isn't working as it should & I can barely make calls @GloCare @GloWorld"},{"tweet":"this has been for two to three weeks..Jos North local Govt this is really annoying. Please do something about it. Thanks"},{"tweet":"I am not sure Mike Adenuga browses with Glo network. @GloCare @GloWorld"},{"tweet":"@GloWorld @GloCare I can now confirm that my problem have been resolved. Thanks and God Bless. @Omojuwa @Ayourb @889BrilaFM @ELEGBETE1"},{"tweet":"Kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. UO."},{"tweet":"Kindly send STOP to 2442 and provide your number for checks. Thank you. UO."},{"tweet":"09059430120, British American junction, Jos Nigeria. I can't view Instagram post at all, is not loading the images"},{"tweet":"Been a while I checked my IG coz of bad network it's high time I bought a new SIM. @GloCare @GloWorld get your shii done asap"},{"tweet":"Got a text that the VAS activated without intent has been resolved. Please WHEN will you restore my airtime??. Pls I expect prompt response"},{"tweet":"I decided to try glo @GloWorld And @GloCare data is still dead. Can't even load a good page in 3 clicks. Una well-done"},{"tweet":"@GloWorld @GloCare you need to stop taking my money. I want my 25 Naira back.... "},{"tweet":"why deduct N50 everytime I recharge for months nw.I neva subscribed to any promo.Pls rectify asap."},{"tweet":"I think it's very rude that you guys end our calls without fair warning about our airtime. We deserve better. #FixIt @GloCare @GloWorld"},{"tweet":"Hello @GloCare @GloWorld I have an issue on viewing instagram post with glo 3gb subscription"},{"tweet":"@GloWorld @GloCare why now I can't even open google page not to talk of my email and I have to submit my report tonight!!!"},{"tweet":"For two days now. Been using a friends Hotspot. No network to even make calls. @GloWorld @GloCare"},{"tweet":"Please who is also experiencing this @GloWorld @GloCare annoying '4G' since 3pm thought it would get better at night but still the same???"},{"tweet":"08163104812, Agric Owutu Ikorodu, Lagos state, 4G/3G. Please what other info do you need?GloCare...."},{"tweet":"been on the call for over 20min nobody is picking just advert, pls can i DM"},{"tweet":"08159353072 , university of Uyo permanent site, Sony C6602 and modem, Uyo LGA, 2G only , 3G only, 2G and 3G. NB: Others experience it too"},{"tweet":"May we know the exact issue being experienced at your location to offer you assistance? TT"},{"tweet":"I am sorry for mis-leading u since. My number is 08050346157"},{"tweet":"Thank u for the prompt reply, but ur officer that did d SIM replacement for me should have advised to re-register my sim"},{"tweet":"To register SIM. SG"},{"tweet":"8050346167 is not registered and has no active data plan. Please visit 18 Lalubu Street, Oke-Ilewo, Abeokuta South LGA, Ogun State. SG"},{"tweet":"Mobile card not activated, and the internet access is slow, my location is abeokuta"},{"tweet":"Good afternoon, we apologize but may we know the exact issue to be assisted/advised? SG"},{"tweet":"@GloCare @GloWorld kindly hlp me to scan my sim card, it's obvious somtin is wrng wit it. 08050346167. I alrdy cld ur cc not hapy wit reply"},{"tweet":"This useless glo is at it again @GloCare @GloWorld... Reducing my credit again... Abi these people are mad ni"},{"tweet":"It doesn't change the fact that I can't use my phone to do anything on the internet. Well, guess its a lesson learnt"},{"tweet":"@GloWorld @GloCare Just got this SMS from the blues. Don't even start!!! "},{"tweet":"Hi SG, UO already replied. Said your engineers are working on it. As I reply you, i'm using another internet source since Glo isn't reliable"},{"tweet":"Tanx but don't understand your last statement."},{"tweet":"Hi my @GloCare @GloWorld please network is been bad for some days now I don't hav access to my fb,Inst etc ..08163104812 that's my number"},{"tweet":"Please visit Gloworld Plot 1, Block 16, Fed Housing Estate, Olu-Obasanjo way, Uyo, Akwa Ibom or 88, Nwaniba Road,Uyo,Akwa Ibom State TT"},{"tweet":"@GloCare @GloWorld I want know if switching on data sub plan on active renewal still attracts d double data bonus, e.g. from 1k to 5k. Thank"},{"tweet":"This is just to inform you guys that I will be porting my phone number to another network. You guys are s***! @GloCare @GloWorld"},{"tweet":"@GloCare @GloWorld that if calls is a okay but Data is not it at all, kindly fix it. Location #Ikorodu #Adamo #Agufoye #Akanu"},{"tweet":"@GloCare @GloWorld this is frustrating, my network is nothing to talk about. Please coman do something about it."},{"tweet":"Okay..08169236372 as the alternate line"},{"tweet":"its always been.. cc: @GloWorld @GloCare ...see!!! no one ever speaks good of you "},{"tweet":"Glo is so messed up right now! "},{"tweet":"Kindly provide your phone number, device type and error response so we can progress. Thank you. UO."},{"tweet":"@GloCare Your internet service is 'crawling' within Ketu-Demurin axis.@GloWorld"},{"tweet":"For security reasons we no longer attend to over scratch card issues please call 121 for further assistance. Thank you. UO"},{"tweet":"Please note that borrow me data cannot get the 100% offer. Thank you. UO"},{"tweet":"Apology accepted BUT can you give a timeline?. I intend to see this to a logical conclusion. Thank you."},{"tweet":"@GloCare @GloWorld hello. I overscratched a #200 recahrge card and been unable to get the correct digits. Pls help."},{"tweet":"it's renewed with reckless abandoned yet you don't give 100% on renewal.What's the gain therein if your regular can enjoy"},{"tweet":"Your refund request has been processed and we will revert to you on this.Thank you .GM"},{"tweet":"And area was everywhere from Fagba to Ogba to Anthony (Ilupeju)."},{"tweet":"08056071913. Refund my money. N100. I never subscribed. Was fraudulently obtained. Thank you."},{"tweet":"Glo'wing with arrogance. Cc @GloWorld @GloCare "},{"tweet":"For all the time I had data but couldn't browse because of your poor network provision and yet you were still 'glo'wing with pride #ISeeYou"},{"tweet":"No error respond, just slow internet and mostly 2g."},{"tweet":"Kindly provide the number and sim serial number or visit any Gloworld with the sim for clarification. SO"},{"tweet":"Why reduce ur data?"},{"tweet":"All this show casing of artists does not move one an inch...make your network work more faster and active...biko"},{"tweet":"Im wondering how one can actually rule his world this way !!!"},{"tweet":"Can u do something about ur network. Its so frustrating! 4 d past 2 weeks dt av had d data plan, av not for 1day enjoy browsing , even chat"},{"tweet":"Can I be reassured that your network in Gwarimpa/dutse axis is fully back.l? You people almost cost me my job coz I ought to be online 24/7"},{"tweet":"@GlobacomNigeria @GloCare @GloWorld The ultimate fuckery network 4 over 3 weeks. Wasted my time and data + lying customer care agents "},{"tweet":"It's using glo!! No network https://twitter.com/Tinu_Kuye/status/864834346649309186 …"},{"tweet":"once I recharge, N15 would be deducted as daily charges on rumor news and am tired. I will stop recharging"},{"tweet":"It can't be with them as I try it with an unregistered MTN line and it goes through till the last moment. Getting this with my glo line."},{"tweet":"Good afternoon, please provide number for check and assistance. SG"},{"tweet":"Your DM on this issue has been responded to. TT"},{"tweet":"Kindly contact your financial institution for assistance with the issue. TT"},{"tweet":"@GloCare @GloWorld, I'm tired of daily charges on my line, I didn't subscribe for any rumor news but u keep deducting my money. I hate this"},{"tweet":"Yo @GloCare @GloWorld, why is the *737# GTB transaction code not working again despite my glo line being my registered line? It's annoying."},{"tweet":"Hello, there is no reduction in data volume. Subscription on active plan or not more than 3 days of expiration, will get full plan bundle TT"},{"tweet":"@GloWorld @GloCare why have you slamsjed your data bundles by half."},{"tweet":"You need to SWITCH to @etisalat_9ja asap. It's simply the best in Nigeria at the moment. So reliable"},{"tweet":"Glo will u extend the validity of my data plan for the 5 days I couldn't access network."},{"tweet":"Are glo.... U are now giving options on data plan.... Are u guys have messed up"},{"tweet":"I also got this from @GloWorld yesterday after my 4 days of complaining. "},{"tweet":"Good morning, issue already escalated on Tue 5/16/2017 8:32 AM and being worked on. Kindly be patient, we apologize. SG"},{"tweet":"Good morning, please dial *127*0# or sms info to 127 otherwise provide number for clarification. SG"},{"tweet":"Please do it fast"},{"tweet":"@GloCare @GloWorld I just subscribed now for the 1k package and I got 1.6gb instead of 3.2gb it ought to export tomorrow"},{"tweet":"I am not the only one experiencing this"},{"tweet":"Sincere apologies, may we have your number, location with exact landmarks and device type for assistance? AA"},{"tweet":"Good morning, you were given the bonus for the #1000 recharge and you have been using it. AA"},{"tweet":"Your network has been extremely terrible recently, it's expected to improve and not otherwise. Fix it! @GloWorld @GloCare"},{"tweet":"The network is overwhelmingly poor. Can't browse nor do anything"},{"tweet":"I didn't get the bonus for the N1000 recharge. That's why I had to recharge 200"},{"tweet":"Line is not registered. Please visit any Gloworld to register the sim. SO"},{"tweet":"We apologize, may we know the exact issue. SO"},{"tweet":"Click this link for data plans: http://www.gloworld.com/ng/personal/data/data-plans/ …. SO"},{"tweet":"You can't use @GloWorld @GloCare globacomm Nigeria internet data to send a mail that would save ur life or job. Very useless network."},{"tweet":"What is the code and amount to sub for Iphone @GloCare @GloWorld"},{"tweet":"If there any @GloCare @GloWorld office in Ibadan cc @Gidi_Traffic"},{"tweet":"dial *127*0# to confirm your data balance ~ OO"},{"tweet":"@GloWorld @GloCare renewed my subscription just now and I was given 1.6gig instead of 3.2gig...not even up to 3days after consumption"},{"tweet":"Wait! You will charge me for a subscription I didn't request ??"},{"tweet":"@GloWorld @GloCare I curse Lizzy! I curse Molly!! What's the meaning of all these na! "},{"tweet":"For instance, i recharge 2 #1000 cards sometimes last week, & i don't know when the bonus will expire. I think this is unfair to customers."},{"tweet":"@GloWorld @GloCare how about you put expire date for bumper bonus, so that customers will know when d bonus will lapse?"},{"tweet":"@GloCare GLOWORLD, am indeed sorry, checking my balance and discovered it was 3228MB. Am sorry for accusing you wrongly. accept my apology"},{"tweet":"is this supposed to be funny? Please do not let me escalate this. I need the transactions reference for the video box."},{"tweet":"I need the transaction reference for the said glo video box. Don't be coy with me"},{"tweet":"@GloWorld @GloCare why are you ignoring me. "},{"tweet":"and please I need the reference number for the said subscription as I want to report to NCC."},{"tweet":"Please sens STOP to 2442 to set DND for all VAS . TT"},{"tweet":"@GloWorld @GloCare I bought a recharge card ystday bt couldn't load it, called 121 &was told dt card ws used on May 10 by another. How come?"},{"tweet":"All these to get a quality service? Do you realise I'm not the only one experiencing this, I would rather you improve your quality for all."},{"tweet":"@Okparageoffrey @GloWorld Please provide number, exact location, LGA, device type, network mode selected, duration, we apologize. SG"},{"tweet":"Using your subscriptions frustrates the life out of me, the data is there, the network is there and yet you can't use it till expiry."},{"tweet":"Good morning, may we know the exact network issue to be assisted/advised? SG"},{"tweet":"Worst network ever @GloWorld @GloCare, yet they'll be making a their adverts look like they good."},{"tweet":"Charged for Glolookcafe at N200/month and Video box at N20/day. SG"},{"tweet":"07059886852 NASME Barracks, NorthBank Makurdi L.G.A, Benue State. Blackberry Q10, 3G/4G"},{"tweet":"the network is on now but very terrible. Can't do anything with it. No page is opening or loading. Thanks"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"Stop forming innocent. ALL numbers. ALL locations. Poor data service. @GloWorld @GloCare"},{"tweet":"My location is M Dikko Road Katsina Nigeria. Pls do something abt our data service @GloWorld @GloCare. My settings r on 3G & it still sucks"},{"tweet":"Bia, are you people even aware of how poor your network is now? So annoying! @GloCare @GloWorld"},{"tweet":"No. I just loaded credit and waited for it to auto renew."},{"tweet":"But u subscribed before it expired"},{"tweet":"Just allow auto renewal. The bonus would come in."},{"tweet":"Yes. It works. Just did mine this morning."},{"tweet":"I dunno why glo network goes off before 10pm in my area for the past 4days @GloWorld @GloCare "},{"tweet":"@GloWorld @GloCare you guys have some explaining to do. I recharged 1k yesterday and I met 700+ this evening. Start explaining"},{"tweet":"@GloCare @CPCNig @NgComCommission @GloWorld if by tomorrow u guys dnt fix this issue I will have to take this up for damages u have caused."},{"tweet":"Wow.. Thanks it has been done"},{"tweet":"dial *127*0# to confirm your data balance ~ OO"},{"tweet":"After sending my no. the status quo remains. 7days after the 15days. No call from you & I guess no network staff checked. Too bad @gloworld"},{"tweet":"@Gloworld @glocare My subscription was renewed and I was given 1600MB. Why is that?"},{"tweet":"I'm on Ilm Bumpa package and I recharged 1000 today but I can't find the Bumpa bonus on my line."},{"tweet":"may we know the challenge with your bonus? OO"},{"tweet":"CPC urges you to formally cimolain to @GloCare. If not satisfied, send a formal complaint with details of the issue to contact@cpc.gov.ng"},{"tweet":"@GloCare @GloWorld Pls I want to know what happened to my Glo Bumpa bonus. My number 08055195001"},{"tweet":"yes you can ~ OO"},{"tweet":"yes please, how may we help you? OO"},{"tweet":"the data plan has not been slashed, may we know the exact challenge experienced? OO"},{"tweet":"thanks.. but I didn't subscribe for any value added services. How can I opt out?"},{"tweet":"Why was it not paid? Or why did u not deduct, any way answer to avoid future occurrence, i lost confidence in glo network yst bcos my airtim"},{"tweet":"I dunno what is taking my airtime oo.. from N2000 to N1500.. @GloWorld @GloCare can u help look into it.."},{"tweet":"@miss__dimples @That_IjebuBadoo @GloCare @GloWorld Very terrible network Glo got."},{"tweet":"@gloworld @glocare fix ur network issue in katsina town, dadangoro area to be precise..not having network for days is not fair."},{"tweet":"Nawa o'@Duke_Joansean: @Winziey @GloCare @GloWorld Dat has always been our bane......'"},{"tweet":"you guys aren't serious at all. I think you shld read this"},{"tweet":"Dat has always been our bane......"},{"tweet":"I am tired"},{"tweet":"I Stay @ Ayobo, Lagos & Wenever Am Browsing D Network Is Always Flunctuating. And Every Body Dat Use Glo Here Always Complains"},{"tweet":"Good morning, may we know the exact issue to be assisted/advised? SG"},{"tweet":"Good morning, please provide your number, card serial number, first ten digits of the PIN, location visited, date for review. SG"},{"tweet":"Issue already escalated on 5/13/2017 06:24:30 PM, kindly be patient while being resolved, we apologize. SG"},{"tweet":"Heys @GloCare @GloWorld you people are useless"},{"tweet":"@GloWorld @GloCare we are now in the middle of the 5th month and you still decide not to send back my overscratched recharge card #500?Hmm!"},{"tweet":"You are welcome. Stay Unlimited! TT"},{"tweet":"Kindly provide your number, error message, exact location with landmarks, issue duration and device type for assistance. TT"},{"tweet":"@GloCare here is a continuation of my disappointment of your network"},{"tweet":"okay. Confirmed. It's there. Thank you"},{"tweet":"Kindly dial *127*0# to check the data balance. Revert with mobile number and feedback for further assistance. TT"},{"tweet":"Not true pls. I did auto renewal and didn't get the value of the previous subscription."},{"tweet":"very stupid and useless network"},{"tweet":"Please why did you slash your data if your network will still be bad? Why? Are you people not tired of yourself? @Glocare @Gloworld"},{"tweet":"And yo centre in sokoto are not friendly to customer at all bcus diz is d third time i experience bad customer service from them"},{"tweet":"Her to cut it into microsim nd in which she said it an old sim. Then i asked for sim swap but i was scare away with d price. 3/3"},{"tweet":"so in other words my countless recharges and subscriptions doesn't count???? Savage!"},{"tweet":"me that is in warri, I no getglo wehdone I go soon port"},{"tweet":"@WarriUpdate @GloWorld @GloCare @officialBovi got invites but man no dey warri presently"},{"tweet":"@GloWorld @GloCare why the sudden increase in data tarrif???"},{"tweet":"Despite my loyal patronage, I didn't get any invite issorait! @GloWorld @GloCare "},{"tweet":"Stage of #GloLafftaFest2017 #Warri set for action "},{"tweet":"Thanks @GloWorld @GloCare I have my 10GB..."},{"tweet":"@GloCare @GloWorld why did you people slash your data capacity to half? "},{"tweet":"The VAS on the line has been deactivated has requested. Stay Unlimited. TT"},{"tweet":"Please provide your mobile number or dial *206*22# TT"},{"tweet":"Please provide your mobile number for assistance to deactivate it. TT"},{"tweet":"Record shows the line subscribe for the Glo Easy Facebook VAS. Dial *2220*22# to deactivate it. TT"},{"tweet":"@GloCare @GloWorld my subscription was just renewed automatically and I didn't get 100% bonus, is this a SCAM!!! "},{"tweet":"When are you guys increasing your 4glte coverage in Ife to nta road area. My modem is wasting and my 3g network is none existence"},{"tweet":"Obio-Akpor"},{"tweet":"08057490421..poor Network connection.NTA road,mgbuoba Location junction.PH. opposite GTbank. 2012(5years) Alcatel pop4"},{"tweet":"Hello, please visit the Gloworld shop for assistance with the call history. TT"},{"tweet":"May we know the exact issue being experienced at your location to offer you assistance? TT"},{"tweet":"d prblm hs nothing to do with my number ..it's that ur services around my hood is poor....Mgbuoba, Location NTA Rd. PH"},{"tweet":"I called the customer care, I has been deactivated for the 2nd time.....but my credit has gone into thin air....would send my number via DM"},{"tweet":"I renewed my subscription and I wasn't given my 100% data bonus. @GloWorld @GloCare"},{"tweet":"And please, enough of the apologies. Just fix the darn thing and have us complain less. cc @GloWorld Thanks!"},{"tweet":"Anytime I remember I still use @GloWorld @GloCare for browsing I notice I always find my sef in a bad mood"},{"tweet":"What the hell!....same day.....I cancelled and you guys subscribed for me again....300 gone into thin air.......makes no sense!"},{"tweet":"@GloCare @GloWorld your network service in mgbuoba Portharcourt is soooo bad!!! And the reason I'm contemplating. Suicide right now..."},{"tweet":"@GloWorld @GloCare pls how do I get tickets to attend glo laff fest in yenagoa n d date n time"},{"tweet":"What do @Omawumi, @iamkissdaniel & @julietibrahim have in common in this PHOTO? http://bit.ly/2qeQddX Cc: @GloCare, @GloWorld"},{"tweet":"In Abuja here, your network switches off during data use"},{"tweet":"It was supposed to be '4G'. But the network can only allow 3G, even the '3G' has downgraded to 'E '...."},{"tweet":"We apologize for any inconvenience you may have experienced. Please describe the exact difficulty. Thank you. UO."},{"tweet":"We apologize for any inconvenience you may have experienced.The complaint has been escalated. Thank you. UO."},{"tweet":"@GloWorld @GloCare Still haven't got ur reply, even if am not qualified, at least I have a right to know"},{"tweet":"Please provide an alternate number. UO"},{"tweet":"If you work for @GloCare @GloWorld, you have not right whatsoever to insult Nepa and compare the naira to the dollar"},{"tweet":"@GloCare 'E is the new 4G 'in Gloworld!How lucky are we to be in a time like this ,where poor service is no longer a bad thing?"},{"tweet":"@GloCare Ur mast in magaji maigari rd, Badawa Layout Kano has been shut down 4 days causing ntwork disruptn 4 glo users. Pls fix @GloWorld"},{"tweet":"What I have with you is an abusive relationship. I'm leaving!"},{"tweet":"Good morning, Yes. Please visit the nearest gloworld/venue and purchase products worth N2000. http://www.gloworld.com/ng/support/gloworld-shops/ … SG"},{"tweet":"Good morning, already converted but 8058797991 is not registered. Kindly visit the nearest gloworld/glo zone to register. SG"},{"tweet":"Glo, 'Ruin your world...'. Once you turn on data, your network vanishes... , @GloWorld @GloCare"},{"tweet":"okay... but I didn't receive any with such information..."},{"tweet":"Work in your 2,3 G network and the 4G is a fraud as it run like no data on the phone"},{"tweet":"Once done, will be cancelled. SG"},{"tweet":"I was awake, so I already called 7728 immediately after that to unsubscribe.....this is not the first time"},{"tweet":"Good morning, please sms DEREG to 7728 to end service. SG"},{"tweet":"@GloCare @GloWorld this your act of always subscribing for callers tune without the user's approval is annoying "},{"tweet":"Charged based on usage. Thank you. SG"},{"tweet":"let me use another phrase, u ppl 4g use to quick and finish, how can I be subscribing every 3 days ?3G doesn't wrk at all"},{"tweet":"Not understood-3G is a crap, 4G runs faster. Kindly expatiate. SG"},{"tweet":"your internet service is Crap , ur 3G network is crap, then ur 4g data runs faster than Usain bolt !!!"},{"tweet":"Please provide your number for clarification. SG"},{"tweet":"Who is telling lie here. I did N1000 subscriptn & I was giving 1.6GB unlike b4. Do I have to autorenw b4 I'm givn full package. Nonsense"},{"tweet":"@fataigiwa @GloWorld Good morning, we apologize, please provide number, exact location, landmark, LGA. SG"},{"tweet":"Met d vendor running d mast.. lots of complaints... @GloWorld havent paid him for 6months, he cant power d mast for 24hrs, only 6hrs per day"},{"tweet":"Ur network outtage became worse afta complain was lodged. 2 days counting no network, voice or data. Mast shut. pls learn 4rm @etisalat_9ja"},{"tweet":"@GloWorld @GloCare I just learnt you guys have reduced your data bandwidth... Why?"},{"tweet":"It is totally unwise stopping your initial data plan amount of 3.5GB for N1000. That was bad. @GloCare @GloWorld"},{"tweet":"It's really disheartening these days that @airtel_care can guarantee a better data service than @GloWorld. @GloCare. What an aberration!!!"},{"tweet":"Great question... it's like they don't know that their network is terrible !!! @GloWorld @GloCare work on your freaking network "},{"tweet":"Mike Adenuga is an icon, i'd like to meet him one day for some life lessons and to know if he uses Glo to browse."},{"tweet":"Having my details alone wouldn't solve d problems still faced around the country. It all started early January, ppl r even scared 2 sub wit"},{"tweet":"Good evening so when is 4G going to be available in Calabar? My network right now is really poor and I can't browse properly"},{"tweet":"@GloWorld @GloCare your data network has been terrible since morning... I haven't been able to do anything meaningful with it... Fix Asap"},{"tweet":"Thank you for the feedback. Stay Unlimited. UO."},{"tweet":"I've done that"},{"tweet":"We apologize. Kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. UO."},{"tweet":"When rain is failing uld just knw that @GloWorld @GloCare can never have network. We glo users r suffering "},{"tweet":"@GloWorld @GloCare Please what is the use of buying 4G phones and Routers from you guys and can't provide the users with LTE services??"},{"tweet":"Just know that after this sub finishes, i'm breaking your sim @GloWorld @GloCare. Bad network, you now half your data rate and still lied."},{"tweet":"@GloWorld @GloCare nice one.... You guys lied ko? If we sub automatically you will give us the full data plan, instead you gave me half... "},{"tweet":"I subscribed for the 2k 7.5gb monthly plan yesterday. But I got 3.8gb."},{"tweet":"the number has just been deactivated, kindly visit a Gloworld outlet for re-activation ~ OO"},{"tweet":"This may be scam becos record of usage had been provided in the http://past.How & when was a whooping N1400 used?"},{"tweet":"Got a notification that you tweeted me. Now nowhere to be found after opening the app."},{"tweet":"can you send me the bonus usage record? This incident happened 2days ago & the memory is still fresh.Intergrity is key"},{"tweet":"Please find solution to this. SIM card I spent close to N5000 to retrieve back. Olorun Oba ko ni ba tiyin je o"},{"tweet":"I asked how I could perform at the event in Calabar tmrw, u asked me to post a short video, which I did, no replies"},{"tweet":"Due to the fact that clients couldn't connect with my line, between last week & this week jobs worth 600k went elsewhere. "},{"tweet":"The event is tmrw in Cali, and I still haven't got a feedback, I think u guys are unfair @GloWorld @GloCare @glo"},{"tweet":"service is back. Pls help confirm a 20k credit on my line frm someone. Have to return thanks to him if it has reflected."},{"tweet":"yes please"},{"tweet":"@GloWorld @GloCare good morning please what's your 4G band?"},{"tweet":"We apologize. Kindly provide your number, exact location, device type and error response so we can progress. Thank you. AP"},{"tweet":"It was not reduced but was reviewed.Subscription on active plan or not more than 3 days of expiration will get full plan bundle. AP"},{"tweet":"Morning, the issue has been escalated. AP"},{"tweet":"Okay. You are welcome. AP"},{"tweet":"you just updated it, it was 5gb before, thanks anyways"},{"tweet":"Morning, you were given 10 GB. Kindly check again . AP"},{"tweet":"08112247068, Bonny island, Rivers State, Samsung J1, No Service."},{"tweet":"and it's showing I v 5gb on my hsi account"},{"tweet":"08071076602 that's the number"},{"tweet":"@GloWorld @GloCare you people will not give me network abi. Or is it because i borrowed 500 naira and i have not paid?"},{"tweet":"So we must subscribed within 3 days... Or else we get punished n our data gets halved Nice one @GloCare @GloWorld"},{"tweet":"@GloCare @GloWorld Are u guys trying 2 punish us 4 not subscribing early? Why must there a time frame 4 subscribing? Naso d money dey?"},{"tweet":"Dear @GloCare @GloWorld , Things are really getting out-of-hand. Care to explain the poor service for 1month+ ? Browsing is TERRIBLE!"},{"tweet":"M using an infinix hot 4 pro n my location is Awada Obosi at onitsha"},{"tweet":"08053455520 is my number, no error msg, I ain't getting strong signal strength while on 3G it hardly browse, it's been like this for 3wks nw"},{"tweet":"Ve done these severally, but for the avoidance of doubt I will send again"},{"tweet":"@GloWorld @GloCare can you please take your data left on my line and give me my money back abeg.Your data service is not encouraging at all"},{"tweet":"This TT is not serious sha. What's the full data bundle??"},{"tweet":"Nna due to poor network coverage in Owerri forced me to drop my glo. Now this post wont make me regret."},{"tweet":"This is ridiculous. How can?"},{"tweet":"Yet you're insisting you guys didn't reduce data volume."},{"tweet":"go these plans for some reasons. I wanted to get to my normal plan today and I got "},{"tweet":"Just so you know, I get 10GB or 7GB when I pay 2500 or 2k respectively. For bout a mo or so, I couldn't 1/2"},{"tweet":"bros, for the sake of your mind just leave GLO. Asked similar ? Days back. Got same reply. I just ignored"},{"tweet":"08058994505, erratic network,idimu(isheri roundabout). 2g worst,3g not stable,3g/2g auto dead"},{"tweet":"where is the bonus?I didn't get or use any bonus & eachtime i dial the bonus code,I get zero bal.Investigate bonus usage"},{"tweet":"08058866369 Seems una wan be unfortunate.this is d 4th time i will be sending my number on this issue...continue!"},{"tweet":"Kindly provide your mobile number for checks and assistance. TT"},{"tweet":"Hello, there is no reduction in data volume. Subscription on active plan or not more than 3 days of expiration, will get full plan bundle TT"},{"tweet":"Record shows the line was given the bonus. TT"},{"tweet":"Slashed?fill me with details please!"},{"tweet":"Hope NCC is monitorng our correspondence as tins goes on. I can't imagine old Nokia touchlght is been charged 4torchlight service called VAS"},{"tweet":"I do not request nor activate any service neither the mobile phone in use do have network facilities. What VAS u pple are talking about."},{"tweet":"There is no effective records keeping with your network as you do apply science of muddling through to deal with customer."},{"tweet":"Hello Ismail. please visit the nearest Gloworld shop for assistance to PORT into the network. TT"},{"tweet":"Please @GloWorld @GloCare return my money "},{"tweet":"Six days no @GloWorld @GloCare network in Damaturu Yobe state capital."},{"tweet":"i wont lie to you guyz i do like you guyz but dis thing u just did is not funny at all tell ur management we dont like it"},{"tweet":"May we know the exact issue being experienced at your location to offer you assistance? TT"},{"tweet":"Simple Q: If I subscribe to a monthly plan of 2500, how much data do I get??"},{"tweet":"Hello, there is no reduction in data volume. Subscription on active plan or not more than 3 days of expiration, will get full plan bundle TT"},{"tweet":"Record shows the VAS has been deactivated since yesterday. Stay Unlimited! TT"},{"tweet":"Till date I still get unsolicited SMS. Even the code you gave to stop it never worked.. Rubbish!!"},{"tweet":"The GLO still persist till now. In fact I don't know my present account balance for now. The mobile I'm using do not have access to internet"},{"tweet":"Why should one be getting a code as call. NCC has advised you telcos to stop unsolicited calls and SMS but you won't hear."},{"tweet":"The way and manner the last #500 loaded in December was depleted to #0:09k is still ongoing without using it to make calls or send messages"},{"tweet":"I didn't activate anything pls. I don't have time for such things..."},{"tweet":"At the time on inserting the sim for activation I met #425.09k what a nasty scenario without even sim active GLO still deducted my money"},{"tweet":"@GloCare @GloWorld People crack jokes at me because I use Globacom. You people are a shame! "},{"tweet":"Prior, 2500 gets you 10GB for a mo. Now, its 5GB for a month. So, what hasn't changed??"},{"tweet":"@GloCare I did this and my account was never credited. I tried loading dcard the normal way it then say card has already been used"},{"tweet":"@GloCare @GloWorld What's up with you internet service. Being very poor since the past two nights."},{"tweet":"Your Glo network is crap you can't even get one stuff done for over 2hrs. Shitty 3G @GloCare @GloWorld . pic.twitter.com/HUox4Ty2Ij"},{"tweet":"@GloCare @GloWorld which level na, you guys don't pick ur calls, you don't reply tweets, what's up with you, please check my last complaint"},{"tweet":"@GloWorld @GloCare this guy is in osun complaining while I'm in Lagos and I am testifying of ur horrible network in alimosho axis "},{"tweet":"It's official. Glo is the worst network company we have in Nigeria. And you wonder why Nigerians don't like buying made in Nigeria products"},{"tweet":"Ve since sent what was required and yet to get a feedback from you guys.. What's the way forward Cos am fed up with the netwk situation"},{"tweet":"You should dial *777# and see for yourself...since you're forming ignorance. Leave auto-renewal...give us bck d 1st deal"},{"tweet":"@GloCare @GloWorld I reckon you have probably already seen this tho... The quality of your network is just something else "},{"tweet":"Kindly provide your phone number for checks Thank you for your patience. UO."},{"tweet":"Pls stop debiting my phone number for text messages that I never sent. Each debit is costing me 35 naira. Pls investigate and refund me"},{"tweet":"Investigations shows that the line is deactivated. Please visit the nearest Gloworld to re activate. UO."},{"tweet":"So @GloWorld @GloCare slashed data prices by a massive percentage without even notifying customers...no heads up whatsoever. Diaris God "},{"tweet":"syoongheart GloCare Yes but you have to call 121 or visit the nearest gloworld. UO."},{"tweet":"For security reasons we no longer attend to over scratch card issues please call 121 for further assistance. Thank you. UO"},{"tweet":"We apologize. We will investigate and revert. Thank you for your patience. UO."},{"tweet":"@GloWorld @GloCare kindly deactivate all sms subscrption on my line i dont want any tips...and this shld be d last time u will thief my #15"},{"tweet":"I'm just wondering if it's possible to retrieve the pin numbers.. please tell me it's possible"},{"tweet":"@GloCare @GloWorld Good morning I tried scratching the covering off the card I bought yesterday but mistakenly smudged the numbers "},{"tweet":"Got a message that this issue has been fixed but d mast was only turned on for 12hrs and shut for d remaiing 12hrs for d past 2 days."},{"tweet":"1/2. @glonigeria @GloCare @GloWorld my iMessage isn't connecting and Apple status site says everything is okay from their end"},{"tweet":"so how does that make sense. To u people if i dont have d money to sub after 3 days... U will now slash it for me...."},{"tweet":"@gloworld @glocare y'all about to experience shortage of customers with d way ur internet services are... It's just a matter of time"},{"tweet":"i just pity you guyz... The downfall of @GloWorld @GloCare is now.. R. I. P glo"},{"tweet":"sense una no get... Ur service is bad una go slash the data that attracts users how do you think this would work"},{"tweet":"@glocare @gloworld My 3.2gb data plan autorenew wasn't given despite your promise. I guess after this plan, I'll move on."},{"tweet":"Data service is horrible, I can't even open a page with a smile. Even calling your customer care I have to start moving around for network"},{"tweet":"and they haven't bothered to make a proper statement/public announcement."},{"tweet":"I didnt get no messages, somehow didnt see all those on social media. I just resubscribed immediately it finished. You shouldnt have removed"},{"tweet":"Kindly clear cookies/browser history, upgrade done routinely to improve. SG"},{"tweet":"But when it's on 3G plan the nework is freaking slow and doesn't open some sites"},{"tweet":"i was told i borrowed on my line like six month ago when i have been using my fone without borrowing"},{"tweet":"Messages were also sent. Available on social media platforms and print media. http://www.gloworld.com/ng/personal/data/data-plans/ … SG"},{"tweet":"Good evening no slash, new rule applies to plan not auto renewed/re-subscribed within 3days after expiration of previous plan. SG"},{"tweet":"Kindly follow back so i could provide you with the details"},{"tweet":"It's the whole state not an individual problem, I don't think there is need for my exact location."},{"tweet":"Reply I received"},{"tweet":"I don't get the 3G network any longer and when it eventually comes, I dnt get more than 3 bar on the signal strength"},{"tweet":"@GloCare @GloWorld what seems to be the problem ve been experiencing bad network since a week back at onitsha here. Pls work on it. Am tired"},{"tweet":"Thanks, it's been updated. But what do you mean by volume limit? Can you explain more on that?"},{"tweet":"@GloCare @GloWorld my subscription is due to expire in 2weeks time but I just subscribed for your 1k plan but was only given 1.6GB"},{"tweet":"Shomolu, Shomolu local govt, iPhone, 4gLte,"},{"tweet":"@GloWorld @GloCare @GloWorldGH is taking their customers for granted"},{"tweet":"This is hilarious, provide my number publicly? No, direct message would be a good idea. Thank you"},{"tweet":"If you trying calling customer care ,they will give you checks answer,@GloWorld @GloCare @GloWorldGH is a 419 network guys,beware"},{"tweet":"Now my 30gb is gone ,my money too is gone,this network is fraud,419 is @GloWorld @GloCare @GloWorldGH https://twitter.com/thisevans/status/862359760250834944 …"},{"tweet":"Now my 30gb is gone ,my money too is gone,this network is fraud,419 is @GloWorld @GloCare @GloWorldGH"},{"tweet":"I bought a data bundle of GHS 80 buh I can't use it cos no reception on their network for the past 3 months https://twitter.com/thisevans/status/862359523666919425 …"},{"tweet":"@GloWorld @GloCare please explain this charge. If I had 700 naira, that call would have lasted for a min. 700 naira per min!!! "},{"tweet":"#-8059140179. Canewood hotel, Ekpan, uvwie LGA. Android. 08022780890. Hospital road, by Zenith Bank."},{"tweet":"We apologize, please provide number, landmark, LGA, device type, alternate contact, exact location in Warri. SG"},{"tweet":"Good evening, we apologize but may we know the exact network issue to be assisted/advised? SG"},{"tweet":"Please select 3G only, upgrade done routinely to improve, we apologize. SG"},{"tweet":"Kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. UO."},{"tweet":"Down here in abuja... We hardly get glo service"},{"tweet":"For good 5 consecutive days no @GloCare @GloWorld network in yobe state."},{"tweet":"We apologize. We are doing what we can to serve you better. UO"},{"tweet":"we experienced poor service for a week then total shut down for 5 days now. No xplntion"},{"tweet":"Thank you for the feedback. Stay Unlimited. UO."},{"tweet":"Yet they said i was mistaken @GloCare @GloWorld "},{"tweet":"Glo 2000 is now 3.8gb no more 7gb. Sigh"},{"tweet":"even @MTNNG informs their customers on changes in data charges and other conditions. And I don't have an MTN line."},{"tweet":"what does that mean. If I get the half data then subscribe before it expires do I then get full or continue to get half."},{"tweet":"3.@GloCare @GloWorld carrying on with an advert that doesn't reflect what you are doing is totally wrong. Your adverts should say the TRUTH"},{"tweet":"2.@GloCare @GloWorld. Been using it because it's a Nigerian brand that I support. You should have informed your existing subscribers of this"},{"tweet":"@GloWorld @GloCare I don't know what you plan to achieve by making your data more expensive but I'm very sure you won't achieve it."},{"tweet":"If you can refund our money and data we won't mind if you shutdown your company."},{"tweet":"Thank you. It's working now."},{"tweet":"thanks. Can i upgrade to ur 4G plan when this plan expires on Samsung galaxy J5 phone"},{"tweet":"You want to turn it on via my phone??"},{"tweet":"You don't need my phone number, there was no network for 5days now. The location is Potiskum, Yobe State"},{"tweet":"Text info to 127 to see exact data received or revert with your number for clarification. SO"},{"tweet":"May we know the exact issue. SO"},{"tweet":"Kindly provide your phone number, device type and alternate number so we can progress. Thank you. UO."},{"tweet":"I gave the location (Potiskum, Yobe St), stated the problem but all u cared for was my no."},{"tweet":"You have violated our customer rights by taking off the #glo #network with no notice"},{"tweet":"If you auto renewed/re-subscribed within 3days after expiration, you will get the full data volume otherwise you will get half. SO"},{"tweet":"The complaint has been escalated to the appropriate unit for resolution. Thank you for your patience. UO."},{"tweet":"RT chuckdeni: GloCare GloWorld 08034924121"},{"tweet":"@GloCare see msg in pix, its not in line with your advert. "},{"tweet":"@GloCare @GloWorld what id u peoples problem again ehn... What kind of nonsense is this one"},{"tweet":"3. @GloWorld @GloCare if you make changes do inform your customers. Not bill them and do as you desire. It's unfair and misleading"},{"tweet":"@GloWorld @GloCare I am a very dissatisfied and furious consumer. Your adverts should reflect what you actually offer on your data plans"},{"tweet":"@GloWorld @GloCare please change your mind to adverts and stop deceiving your customers. How can you advertise one thing and offer another"},{"tweet":"@GloWorld @GloCare fair play, you just changed your trusted 2500 for 10 Gig DATA plan over night , I'm leaving your network to @MTNNG"},{"tweet":"My phone has no service. That is what is displayed on the network bar 'no service' since yesterday."},{"tweet":"Good morning, we apologize but may we know the exact network issue? IQ"},{"tweet":"Tried unsubscribing from it before, but it failed. Kindly return my money. U do not force people to subscribe for services against dere wish"},{"tweet":"so I could renew my sub... I was charged #160 for this service that I didn't subscribed for. And as you can see from the attached images, I"},{"tweet":"Glo is probably the most messed up thing in this country right now(second to the government ofcourse) wtf!!! Fix up @GloCare @GloWorld"},{"tweet":"Dear @GloWorld @GloCare why haven't I had service for the past 5hrs?"},{"tweet":"Kindly compare the plans (in pic) to what it used to be... The previous data plans brought you so many customers. Do av a rethink please"},{"tweet":"https://twitter.com/glocare/status/862033046614265856 … sale something for what it is @NgComCommission"},{"tweet":"Didn't subscribe within 3days after expiration of previous plan. SG"},{"tweet":"Didn't subscribe within 3days after expiration of previous plan. SG"},{"tweet":"yes that is the problem u said 500 for1.5G so how does wen I subscribe matters @NgComCommission"},{"tweet":"@Saddique1802 @GloWorld Good evening, please provide number. SG"},{"tweet":"Still as terrible as ever its on Edge i had to leave the house to reply this message"},{"tweet":"See when i am getn ur msg ,the location is samsonibare off ogunlana drive,landmark is samsonibare recreation centre my num is 08058995183"},{"tweet":"Please try to attend to this issue its urgent I have spent a lot on this and always unable to enjoy my internet suff"},{"tweet":"Whenever I Subscribe I find it very difficult to use the sub... Over here in Portharcourt city GLO is very bad"},{"tweet":"U see am? No single bar at all. It keeps fluctuating."},{"tweet":"Say that to customers that haven't fallen for your trick. You've lost me already. Bye bye to @GloWorld for data. Welcome @AirtelNigeria"},{"tweet":"After I exhaust this current data I just bought, just know you've lost a data customer. Time to go with my best network @AirtelNigeria"},{"tweet":"Wch means insted of getin actual desired data vol. I'll now get about 3/4gb less? It don't make sense. I could kill dat autorenew thing rn."},{"tweet":"Why wasn't this made public before now? Funny"},{"tweet":"Please call 444 help desk or email 3gsupport@gloworld.com for consideration of your request. TT"},{"tweet":"Hey @GloWorld @GloCare wtf I'm trying to subscribe for the 3k data & befor I clf say jack robinson, d 1k one got renew. Can I cancel it plss"},{"tweet":"Kindly view details at the link: http://www.gloworld.com/ng/personal/data/data-plans/ … TT"},{"tweet":"I'm still shocked at the decision... A non profitable strategy by @GloWorld @GloCare "},{"tweet":"So @GloWorld y'all just woke up and decided to increase data plan and reduce the network you giving us? No sense whatsoever"},{"tweet":"This is very bad. I am highly disappointed with your handling of this issue. I have 11GB unused data on my bundle. I need renewal only.pls"},{"tweet":"Plan has been effective Tuesday, April 25, 2017. Please find attached the new rate. SG"},{"tweet":"On the @GTBank's #MobileApp, 48GB is what I saw there. Just check this screenshot I took for evidence."},{"tweet":"@Rothecity @GloWorld Messages were sent. However, once renewal done within 3days after expiration of this, 100% will be given. SG"},{"tweet":"How was I supposed to know that when you never sent me any message to inform me of this devpt? Mind u, I bought it on @GTBank's #MobileApp."},{"tweet":"If it's not for dishonest intentions, why this idea, and why wasn't there a prior communication? @GloWorld @GloCare"},{"tweet":"To extend, please recharge via *123 then dial the code of the plan needed. SO SPECIAL, 10Gb for 30days, sms 58 to 127 or dial *127*58#. SG"},{"tweet":"When you recharge with the code *223*PIN# you subscribed for the Glo Twin Bash Dial*606 to check your account. TT"},{"tweet":"You advertised for renewal before expiration & use of *223* code for rewal of data bundle. I just want my bundle renewed. Pls help."},{"tweet":"08053098834 That's my number. You don't know how you people are making me feel now. I swear, you are nt going sscot-free with this."},{"tweet":"This is after calling the serial number. I can only see the 1st 5 digits. Really having regrets at the moment."},{"tweet":"Help I recharged using *223* code for my renewal due tomorrow, my no is 08077603351. Getting funny msgs. Pls help me fix this problem."},{"tweet":"Kindly dial *127*0# to check the data balance. Revert with mobile number and feedback for further assistance. TT"},{"tweet":"Please note, with active plan, or data expired less than 3 days, line gets the full data bundle. Otherwise, the plan is halved. TT"},{"tweet":"I said Rumuolumeni. Which is at Obiakpor LGA. I don't know if it's like that all around Rivers State. It has been like this for days."},{"tweet":"There is no network bars since morning. Not about browsing. I mean, not even 1 bar of service on the phone. 1 bar comes, & it goes again."},{"tweet":"@GloWorld @GloCare Rumuolumeni Portharcourt are having a fluctuating network. We can't even make & receive calls. Can U guys do something?"},{"tweet":"You said 6hrs.. and its over 30hrs already. Why sell data if u can guarantee good network?"},{"tweet":"This issue is still unattended to. @GloWorld data network grounded in Kano."},{"tweet":"@GloWorld @GloCare please kindly assist. i find it impossible to check my subscription status. the data left and expiry date. kindly assist"},{"tweet":"@GloCare @GloWorld enough is enough, time to port out of your network, every week deduction is OK. I hate Glo for this. Rubbish."},{"tweet":"I'v never ever subscribed anything,I'v never ever received any SMS or call from @GloWorld yet U stole thousands from me.I want my money back"},{"tweet":"Hello Kelly, record shows the line was credited with N85 only that day. TT"},{"tweet":"#ProfessorJohnbull today takes us on an interesting voyage on the significance of high moral standards. @KanayoOKanayo @GloWorld @GloCare "},{"tweet":"I loaded N1000 tru gtb mobile on the 14/4/17. but with no airtime but i was told dat d fault is frm my u. no 09058287780"},{"tweet":"You are welcome. Stay Unlimited! TT"},{"tweet":"Treated. Thank you. SG"},{"tweet":"We apologize but kindly state the exact network issue. Thank you. SG"},{"tweet":"Good afternoon, kindly check your DM for response. Thank you. SG"},{"tweet":"Thank you very much. The issue has been resolved. Cheers."},{"tweet":"AimeeBFly GloCare Hello C, Standard SIM replacement is officially N100 at the Gloworld shop. TT"},{"tweet":"For real!? U certainly don't need a suit sayer to tel you your SERVICE is way too bad.. M sure even your ambassadors don't use @GloWorld..."},{"tweet":"LOL. Alright. Thank you."},{"tweet":"can't provide my number on the timeline. Dm"},