{"text":"\"@OluseunOloyede: RETWEET if @GloWorld data service is very poor.\nFAV if you are currently enjoying @GloCare  data service. \n@Gidi_Traffic"}
{"text":"@TrafficChiefNG True or False? @glocare https://t.co/MCQNvgFCF7"}
{"text":"@GloCare as for my phone number I'd prefer to \"slide\" into your DM to give you that, but I can't access you there."}
{"text":"... @GloCare I've called 444(that took 4days to reach them) &amp; complained, I'm yet to see any improvement."}
{"text":".@GloCare my response is coming late cos i'm just seeing this. You people hv refused me from accessing d internet in d day time. I've..."}
{"text":"@GloWorld @GloCare @officialEFCC my number is 08077867702. Dats D line @mypaga refused 2 credit after debit'n my accounts N3250. Pls help me"}
{"text":"Pls @GloCare cld U help me confirm 2 @mypaga that I DID NOT get N3000 and N250 credit from them on the 6th and 7th of June. Pls"}
{"text":"Its all lies, @officialEFCC. @mypaga never credited me. @GloCare can bear me witness. I called them after i noticed i wasnt credit."}
{"text":"RT @iameneji: Glo network is SHIT @GloWorld @GloCare"}
{"text":"@iameneji @GloWorld @GloCare Walahi"}
{"text":"@EzinwaCent @GloCare @Gidi_Traffic @TrafficChiefNG Glo internet service is so poor everywhere. There is a major problem with them."}
{"text":"@GloCare For one week I have been unable to browse. I live in agege. I am  tempted to break my sim, due to your incompetence."}
{"text":"@GloCare @GloWorld @theRealFakeGEEK Keep apologizing while you keep losing customers... It will take your engineers… https://t.co/mse2QiUexv"}
{"text":"RT @1baga: @Teejaytopsticks @GloCare Flight ke.. Don't even power for that one.. Anytime they are ready but for now, i am out"}
{"text":"@1baga @GloCare Thanks for your understanding and patriotism...  @GloCare would respond soon.  God bless you!"}
{"text":"@Gidi_Traffic   internet connection for a week now thanks to glo, 10gb data is useless...grand master of data my foot   @GloCare @GloWorld"}
{"text":"@1baga @AlikoDangote @GloCare Aww, I was just trying 2make u laugh a bit, but I think the data issue got u real bad… https://t.co/eO0M9CI3pG"}
{"text":"@GloCare please note that your service was poor within UBA house Marina axis. Kindly investigate and resolve"}
{"text":"@GloCare https://t.co/3aJ9Nxh2kd"}
{"text":"@Teejaytopsticks @GloCare Flight ke.. Don't even power for that one.. Anytime they are ready but for now, i am out"}
{"text":"RT @daliaselorm: @GloCare i have not hard network on my phone for a week now. i am in akatsi in the Volta region of ghana"}
{"text":"@1baga Haba! my brother, there's always light at the end of every tunnel. Let's not fight over What's solvable.… https://t.co/1nWNvuFok9"}
{"text":"@Teejaytopsticks @AlikoDangote @GloCare Please just shift"}
{"text":"@1baga Satisfaction is not within d reach of we humans, it's why we work MORE for MONEY. Ask @AlikoDangote However,… https://t.co/tZhIIagOyy"}
{"text":"@GloCare please can I get help with activating NGN1,000 data plan on my Line?"}
{"text":"@Glocare Do you have anything to say on this matter 👇👇 https://t.co/qzlkdLiNeb"}
{"text":"@iam_rotana @GloCare @GloWorld Hahaha. Abi ooo"}
{"text":"@GloCare  your subscription is beginning to piss me off what is 1thousand for 1.6GB??????"}
{"text":"@gloworld, fix your network. It's almost a week now! @glocare #badpublicity"}
{"text":"What are you not satisfied with in our network???  Kindly tell us cc @GloWorld @GloCare https://t.co/tgmcyCehCr"}
{"text":"09053825314, can the number enjoy 100% data bonus @GloWorld @GloCare"}
{"text":"@GloCare @Saule_surya @GloWorld what's the essence when am sure that d person managing glo's handle does not use glo"}
{"text":"@GloCare https://t.co/aM4WVlQtG2"}
{"text":"@GloWorld @theRealFakeGEEK @GloCare  my body, my soul and my spirit will continue to curse u each day. NCC shuld ave sanction u by now"}
{"text":"@GloWorld @theRealFakeGEEK @GloCare  stop asking people for dere number and location. You already known your network sucks by now"}
{"text":"@GloCare @ruby_eventsng  @GloWorld https://t.co/R9PIiCRN5d"}
{"text":"Dear glo @GloWorld @GloCare your crappy network is about to cost me a huge shoe contract.If it doesnt go through u guys better be ready(1/2)"}
{"text":"@GloCare  why should I activate auto renewal and I recharge and it won't work out"}
{"text":"@GloCare Poor network coverage \nGrand Master of sluggishness"}
{"text":"@GloCare What is the update on my complain?"}
{"text":"@GloCare I would like to know the code to check my data plan"}
{"text":"RT @Gidi_Traffic: \"@OluseunOloyede: RETWEET if @GloWorld data service is very poor.\nFAV if you are currently enjoying @GloCare  data servic…"}
{"text":"@GloCare @GloWorld 08157241743, alapere ketu, sony Xperia Z3, network fluctuate/no service"}
{"text":"@GloCare @NgComCommission Grandmaster of Data.....revert my cards ooo.....#PortingNaFreeOooo"}
{"text":"@GloCare @GloWorld I can't surf make/received calls epileptic/no service awful service in general"}
{"text":"@GloCare @NgComCommission ...to it; after subscription of 1k the balance should be N50 I met N25...I need a respons… https://t.co/lmxg61qU0R"}
{"text":"@GloCare @GloWorld 08074423706, infinix hot4, alapere ketu Lagos, no service"}
{"text":"@GloCare @NgComCommission I want to renew my plan and I load a card of 1k without making a call I met 950....then I load N100....."}
{"text":"@GloCare glo y? My 2.5gb is just there.i have'nt even used up to 10mb.the ntwork is very slow.i'm really dissappointed.what's d problem tho?"}
{"text":"Glomobile: The Grand Masters of Unusable Data. The largest network of bad customer service.  @GloWorld @GloCare"}
{"text":"@GloCare @NgComCommission I want my call card revert all call card you have deducted...I want a response ASAP...ve call your CC not picking"}
{"text":"RT @boladam4real: @GloCare @GloWorld hello.pls,confirm if ikorodu is covered for GLO 4G service and also If my device is compatible; I use…"}
{"text":"@GloWorld @GloCare It is frustrating actually, it takes forever for a page to load. I just must port"}
{"text":"@GloCare I have notice different amount deduct from my acct without reason for it....today it was so annoying @NgComCommission"}
{"text":"@GloCare @GloWorld It's just frustrating... It takes forever for a page to load. I just must port."}
{"text":"@GloCare Despite for the fact that I was having challenges surfing the Web, 50 naira  was deducted from my account, please kindly reverse."}
{"text":"@GloCare evening, I am seriously angry with you people last week your network misbehave and also you pple deduct my call with no reason..."}
{"text":"@GloCare The network can't load anything"}
{"text":"@GloCare Have never used up my data balance"}
{"text":"@GloCare Have been wasting my money subscribing"}
{"text":"@GloWorld @GloCare @CPCNig @NgComCommission @ConsumersNCC #YearofTelecomconsumer #Consumerprotection  what are you doing about this?"}
{"text":"@GloCare @GloWorld With 1.5gig on my on fone yet I can't even whatapp.. too bad.."}
{"text":"RT @Victor_SciFi: @GloCare Subscribed last night and nothing since then"}
{"text":"RT @Victor_SciFi: @GloCare HEEEEEELPPPP"}
{"text":"RT @Victor_SciFi: @GloCare I do, your service is still processing my request since last night"}
{"text":"@GloCare @GloWorld Am porting to another network.. it's a shame..grand Master of data indeed"}
{"text":"@GloCare I do, your service is still processing my request since last night"}
{"text":"@GloCare @GloWorld U guys shld also work on ur staffs especially d females..they are rude very rude.. they don't ca… https://t.co/85LMwidvtJ"}
{"text":"@GloCare @GloWorld Those guys are not engineers cos fr over a week + now. Ur network is tirrible.. they can't fix i… https://t.co/qGWVSxx1BA"}
{"text":"@GloCare Pls I need solution asap"}
{"text":"@GloCare Your engineers are always working on it. Either get new engineers or get new owners abeg. Nonsense"}
{"text":"@GloCare what is the meaning of this msg:\nYou have been granted a bonus of 0.00NGN. On your main balance, now your credit is empty. #DNDME"}
{"text":"Just hope that @GloCare have sort out the network issue we are facing for some days now around OWODE??Tomorrow is Sunday for crying out loud"}
{"text":"@theRealFakeGEEK @gentlebukan @GloWorld We apologize we are on it. Please bear with us. UO"}
{"text":"RT @GloWorld: @theRealFakeGEEK @GloCare May we have your Glo number? Kindly dial 777*# for your number. FA"}
{"text":"@Chizoba_OKAGBA @GloWorld We apologize we are on it. Please bear with us. UO"}
{"text":"@GloCare @GloWorld @CPCNig @NgComCommission you have no regard for your consumers and everything you do is just a front."}
{"text":"@olumidrizzy We apologize for the inconveniences experienced. Our engineers are currently working on the issue. Kindly exercise patience UO"}
{"text":"@GloCare @GloWorld @GloCare"}
{"text":"@adapekem @daliaselorm We apologize for the inconveniences experienced. Our engineers are currently working on the… https://t.co/9EftD0tahU"}
{"text":"RT @theRealFakeGEEK: I'm permanently off your network and my new solution for data is to be carrying my spectranet modem around 🖕 https://t…"}
{"text":"@TheSagachristos We apologize for the inconveniences experienced. Our engineers are currently working on the issue.… https://t.co/9jfcHWuAFq"}
{"text":"@That_IjebuBadoo We apologize for the inconveniences experienced. Our engineers are currently working on the issue.… https://t.co/3yV013ckCz"}
{"text":"@urbangraffics @GloWorld We apologize for the inconveniences experienced. Our engineers are currently working on th… https://t.co/WIdzZQ8Vc5"}
{"text":"@b560285c4b21457 We apologize. You initiated a fresh tweet. UO"}
{"text":"@Victor_SciFi We apologize. Ensure you have the correct settings. APN- Gloflat, Username - Flat and Password-Flat. Thank you. UO."}
{"text":"@GloCare Yea everything is on point.. that's the first thing I always check .. it's from your side cos everybody I… https://t.co/Hx4DBykfkr"}
{"text":"@theRealFakeGEEK @GloCare May we have your Glo number? Kindly dial 777*# for your number. FA"}
{"text":"@Turaii_ We apologize for the inconveniences experienced. Our engineers are currently working on the issue. Kindly exercise patience UO"}
{"text":"@theRealFakeGEEK @GloWorld We apologize for the inconveniences experienced. Our engineers are currently working on… https://t.co/LOBc9eNFo3"}
{"text":"I'm permanently off your network and my new solution for data is to be carrying my spectranet modem around 🖕 https://t.co/K2bf92EI5T"}
{"text":"@GloCare @GloWorld @gloword Issue: Terrible internet connection for over a week\n\nLocation: Luth, Idi-araba\n\nDevice… https://t.co/PeU8kUvag0"}
{"text":"@GloCare @gentlebukan @GloWorld Mumu network, which patience?, I've been struggling with your network for more than 3 weeks, crap!"}
{"text":"RT @That_IjebuBadoo: @GloCare bout to break up with you bitches. Very useless. A disgrace to Internet connection. Big disgrace"}
{"text":"@acerexy @GloWorld @iameneji We apologize for the inconveniences experienced. Our engineers are currently working o… https://t.co/gimy1KtoJR"}
{"text":"@GloCare @GloWorld \nAre you sure I wasn't expecting that ritualized expression?"}
{"text":"@GloCare My number is 09051326542. It been in unused for the  past 5 days due to bad network"}
{"text":"@Turaii_ Ensure you have the correct settings. APN- Gloflat, Username - Flat and Password-Flat. Thank you. UO."}
{"text":"@David_Gegs @kenedy1981 Kindly provide your phone number, exact location, device type and error response so we can progress. Thank you. UO."}
{"text":"@ohenkay @GloWorld We apologize for the inconveniences experienced. Our engineers are currently working on the issu… https://t.co/8h4pngtXhL"}
